[
  {
    "url": "https://www.sunmarke.com/admissions/school-forms/",
    "title": "School Forms - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 1,
    "content": "School Forms - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login School Forms Admissions > School Forms School Forms Sign Up For Your Child's Future 1 Admissions Recommendation Form – Primary Download 2 Admissions Recommendation Form – Secondary Download 3 DHA Student Medical History Form Download 4 DHA Student Medical History Form Arabic Download 5 Student Withdrawal Form Download 6 Transfer Certificate Template Download 7 Transport Agreement Download",
    "relevance_score": 0.35
  },
  {
    "url": "https://www.sunmarke.com/admissions/faqs/",
    "title": "FAQs - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 1,
    "content": "FAQs - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login FAQs Admissions > FAQs Frequently Asked Questions (FAQ’s) All You Want To Know About The School And Its Facilities We have compiled a list of questions that parents are most likely to ask us in the early stages of the application process – we hope you find it useful. Should you have any other questions, please get in touch with our Family Happiness Team and we will be happy to help. How do I enrol my child? Enrolment for 2024-25 – New families 1) Can I come in for a school tour with my family? Yes, we would be delighted to welcome you and your family for a school tour. It’s a great opportunity to experience the atmosphere and gain insight into our school. 2) KHDA Parent School Contract Please note that: Students can only attend school if they are registered in the KHDA School System, and parents have signed the Parent-School Contract. The school will register the student once all the relevant documents have been uploaded by the parents. This contract needs to be digitally signed only once – by parents of students who are new to the school. The contract is usually sent via sms on their local mobile phones registered with the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents required to complete the registration process: Latest School Reports School reference letter, if a report is not available Attested Transfer Certificate 1 Passport Size Coloured Photo (Student and both Parents) Student Passport Copy Sponsoring Parents Passport Copy Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy 4) Age Cut-Off Dates New students must be enrolled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. How do I book Assessments? Admissions are open year-round, with prorated fees available. We are booking assessments for FS1, FS2, Year 1 to 10, and Year 12. For students currently overseas, we can offer online assessments. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. Can my child be assessed before arriving in Dubai? Online Assessment Procedure: The assessment will take place at home under exam conditions via MS Teams. For Year 6 and below, we recommend adult supervision throughout. Ensure your child has a quiet, distraction-free workspace and the necessary equipment: a computer with internet, video, and audio capabilities. All other electronic devices should be switched off. You will receive an email with the meeting link. Please check access ahead of time and join at the scheduled time. Assistance is only allowed for setting up the meeting and login. Any interference during the assessment will invalidate the results. Assessment Checklist: Quiet, well-ventilated workspace. Computer with internet, video, and audio. All distractions (TV, phones, etc.) turned off. Microsoft Teams ready to join the meeting. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students - FS1 to Year 13 - 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in maths, literacy, and SEMH (social and emotional mental health). We currently offer an alternative curriculum pathway for Key Stages 3 and 4. 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, delivered by specialist teachers and LSAs. There is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSP cost. This will then be a separate invoice. 5. How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am For detailed EYFS timings click here For detailed Primary timings click here For detailed Secondary & Sixth Form timings click here What school transport is offered? What school transport is offered? Sunmarke uses an independent third party bus operator “My Bus Transport Services LLC” to make the school run as easy as possible. “My Bus” operates an air-conditioned and efficient transport service from various parts of Dubai to the school. Parents may avail of this service at their own discretion and cost. My Bus Transport Services manages the school transport operations. The details of services, route and fees, are now available from the Transport office. You can also find the details online, please click here . For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm onwards Friday 12:10 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:40 pm onwards Friday 12.10 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:40 pm onwards Friday 12:10 pm onwards Further communication related to pick-up and drop-off schedules will be shared by the transportation department upon successful registration and payment. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays EYFS Break 09:40 am – 09:55 am Not available Lunch Not available Not available Primary Key Stage 1 (Y1 - Y2) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 10:50 am – 11:45 am Not available Primary Key Stage 2 (Y3 - Y6) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 11:45 am – 12:40 pm Not available Secondary (Y7 - Y9 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 1:10 pm – 01:40 pm (Monday to Tuesday) 12:40 pm – 01:40 pm (Wednesday to Thursday) Not available Secondary (Y10 - Y13 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 12:40 pm – 01:40 pm (Monday to Tuesday) 01:10 pm – 01:40 pm (Wednesday to Thursday) Not available 10. How do I pay for my child's lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child's lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child's growth development. If your child doesn't have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies. How do I enrol my child? Enrolment for 2025-26 – New families 1) Can I come in for a school tour with my family? We are now able to conduct school tours for prospective students and their parents. 2) KHDA Parent School Contract To prepare for enrolment into the new academic year 2025-26, please note that: Students can only attend school in the new academic year if they are registered in the KHDA School System and parents have signed the Parent-School Contract. Please download the Dubai Now App which will enable you to sign the Parent/School Contract online. This only needs to be signed by parents of students who are new to the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school for 2025-26, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents that should be submitted to the school are: Letter of current enrolment at school (Year 2 Up) Transfer Certificate (Attested by UAE Embassy) School reference letter (Year 2 Up) School Reports – 2024-25 (Year 2 Up) 1 Passport Size Coloured Photo ( Student and both Parents) Student Passport Copy Student UAE Visa Copy Sponsoring Parents Passport and UAE Visa Copy Birth Certificate (in English or Arabic) Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy DHA Medical & Immunisation Consent form 4) Age Cut-Off Dates New students must be enroled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. What are the age requirements for AY 2024-25? 1. What are the changes to the age requirements for entry to Sunmarke School? Age requirements will change for new students enroled into FS1, according to the UAE Ministry of Education Resolution no (24). Children enroling into FS1, starting in September, must be three years old on or before the 31st of August. Children enroling into FS2, starting in September, must be four years old on or before the 31st of August. Similarly, children enroling into Year 1, starting school in September, must be five years old on or before the 31st of August. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. This includes students who enrol for the final term of the 2023/24 academic year. Schools that start the academic year in September, in line with MOE Resolution no (24). Year Group Age requirement Foundation Stage 1 3 years old by August 31st Foundation Stage 2 4 years old by August 31st Year 1 5 years old by August 31 Year 2 6 years old by August 31 2. When did this change come into effect? This change was applicable from the start of the 2021/22 academic year in September 2021. 3. Why was this change made? This decision was made to bring more consistency to the cut-off dates used by schools in the UAE with those used by schools abroad. For example, UK schools in the UAE will now have the same cut-off date as schools in the UK, and international British schools. 4.Who will this change impact? This change will impact children up to six years old who are enrolling in school for the first time. 5. Will the new cut-off date apply to all year groups? It will apply to new students enrolling in FS1, FS2, Year 1 and Year 2 in all schools in the UAE, as stipulated in the MOE resolution. 6. My child was born in October and is now in FS1 – I want to enrol him in another school for FS2. Can I do this or does he have to repeat a year? Because your child is already enroled in school, the new cut-off dates in the MOE resolution do not apply. He does not have to repeat the year. 7. My son was enroled in FS1 this year but I withdrew his enrolment due to COVID-19. He’ll be 3 years old in September. Can I still enrol him in FS2 next year? Your child must have formally finished the previous academic year in order to enrol in the next one. Since he does not meet the age requirement for FS2 for next academic year, he must enrol in FS1. According to the MOE resolution, he can enrol in FS2 next academic year only if he completes FS1 this academic year. 8. My daughter will be 4 years old in December. If I enrol her in FS2 for the last term of this year – before the changes come into effect – will she be able to start Year 1 next year? Yes. The new age requirements will apply for new students from the start of the next academic year only. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. 9. I’ve already registered and paid the deposit for my daughter to start school in FS2 in September. She will be four years old in November. Is she affected by this? According to the new cut-off dates in the MOE resolution, your daughter will not be able to start in FS2 in September. Alternatively, we would be happy to transfer your child’s application to their age-appropriate year group (FS1) and register your child for this year group instead. Parents whose children are affected by the new cut-off dates and who have already paid deposits for their children’s enrolment are entitled to a refund if they wish. 10. My child was born one day after the cut-off date. Is there some leeway given? No exceptions to the cut-off dates will be given under any circumstances How do I book Assessments for entry 2025-26 AY? Admissions are now open for applications for 2025-26 AY* entry. The 2025-2026 Assessment Diary is Open – We are now booking assessments for year groups FS1 & FS2, Year 1 to 10 and Year 12. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. For students currently overseas: For students in current Year 6 and above we can offer Assessment at the current school attended. Please contact us to find out more. Students transferring from UK schools in all years, please contact us directly for more details. Can my child be assessed before arriving into Dubai? For Students entering Year 7 and above, assessment can be offered at the current school attended if that school is willing to administer the test under examination conditions. The assessment will be the same as that taken by our local students with the addition of a Skype interview. You will need to provide registration, a letter of enrolment, the latest school report, and a recommendation form by the date of assessment. For students transferring from UK schools please contact admissions directly to discuss your application. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students – FS1 to Year 13 – 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in language, maths, literacy, and functional independence. We are currently working to develop our range of alternative curriculum pathways for Key Stages 2, 3, and 4 so that, in time, we can offer an appropriate pathway for every learner. What is Year 7 and Year 8 Life skills Pathway? 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, supplemented by ASDAN modules. As it is a supplemented curriculum which focuses on reduced teachers, as per KHDA, there is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSA cost. This will then be a separate invoice. 5 How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. For more information on the pathway, please click here What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? Students transferring to Sunmarke School from Regent International School, will not be required to pay additional Assessment or Registration fees. Transferring students are only required to complete the RIS Re-Enrollment Form and pay the 5 % re-enrolment fee by the start of the third term each year to secure their seat. What are the tuition fees and discounts for Regent International School transfers to Sunmarke school for FS1-Year 13 (2025-26)? Fee Structure – Transferring students from Regent International School to Sunmarke School Application Fee Dhs.525/- – Not chargeable Re-enrollment Fee (Existing Students) 5% of Tuition Fee – Non-refundable, adjusted against the 1st Term’s Tuition Fee, 1st day of Term3 Transferring RIS Students Phase Tuition Fees Year Group Discounted Tuition Fees for students transferring from Year 6 at Regent Foundation 1 46,700 Foundation 2 51,900 Year 1 58,548 Year 2 58,548 Year 3 59,619 Year 4 59,619 Year 5 59,619 Year 6 59,619 Year 7 67,290 Year 8 67,290 Year 9 67,290 Year 10 69,397 Year 11 69,397 Year 12 70,276 Year 13 70,276 Additional Benefits: Sibling Discounts: 1st Sibling 5%, 2nd Sibling 10%, 3rd Sibling 10%, 4th Sibling 10%. The sibling discount scheme is available to those siblings from the same family who enrol at the school for one full academic year. The sibling discount is applicable to the 2nd, 3rd, 4th and 5th child from the same family. The amount of the discount is calculated off the actual Tuition Fee paid of the child who pays the lowest tuition fee amongst the siblings enrolled at the school. The maximum discount per family cannot exceed 35% of the lowest paying sibling’s Tuition Fee. SCHOOL ACCOUNT DETAILS TUITION FEES – DUE DATES Payment can be made via wire transfer to the following account: Re-enrolment 15 th December Account Name : SUNMARKE SCHOOL LLC Autumn Term 01 st August Account Number : 12000921414 Spring Term 15 th November Bank Name : National Bank of Fujairah PJSC Summer Term 15 th February Branch : Jebel Ali Swift : NBFUAEAFDXB IBAN # : AE220380000012000921414 Remarks : Please email proof of all payments to: accounts.sms@sunmarkedubai.com , and cc: officemanager.sms@forteseducation.com & registrar.sms@forteseducation.com Additional Fees (charged separately from Tuition Fee): Optional Transportation Services via 3rd Party Service Provider; Optional Dining Services via 3rd Party Service Provider; Optional After-School Activities provided by 3 rd Party Service Providers; School Uniforms; Educational Visits; School Fees are subject to change in accordance with the Knowledge and Human Development Authority (KHDA) Fees Framework What are the sibling discounts if siblings are at both Sunmarke School and Regent International School for 2025-26? In cases where the eldest sibling transfers to the secondary phase at Sunmarke School, but the FS and Primary Phase siblings stay at Regent International School the following discount policy will be applied on full-year attendance: Example 1: Eldest Child (1st Child in the family) – Attending Sunmarke: No Discount 2nd Child from the same family (Sibling 1 at SMS): 5% deducted from 3rd Term Tuition fee as per SMS Policy 3rd Child from the same family (Sibling 2 at SMS): 10% deducted from 3rd Term Tuition fee as per SMS Policy 4th Child from the same family (Sibling 3 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy 5th Child from the same family (Sibling 4 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy Example 2: Eldest Child (1st Child in the family) – Attending Sunmarke School: No Discount 2nd Child from the same family (Sibling 1 at RIS): 5% deducted from 3rd Term Tuition fee as per RIS Policy 3rd Child from the same family (Sibling 2 at RIS): 10% deducted from 3rd Term Tuition fee as per RIS Policy 4th Child from the same family (Sibling 3 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy 5th Child from the same family (Sibling 4 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy *Please note, that these discounts will be applied to the 1st, 2nd, 3rd or 4th siblings 3rd Term of joining actual Tuition Fee. The maximum discount per family is equal to 35% of the lowest sibling’s tuition fee. What is the Sunmarke School and Regent International School returning students -Founders Fee entitlement? If a Regent International School or Sunmarke School student leaves the school but returns to the School before the end of one (1) academic term, they will keep their entitlement to the Regent International School Transfers to Sunmarke School Tuition Fee Structure. If more than one Term passes, then the student will be considered a New Student and will be required to pay the New Students Fee Structure as applicable to their group of re-entry. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What is the class capacity? Class Sizes for Academic Year 2025-26: To ensure each student receives the individualised care he/she deserves, we cap classes based on the year. Below is a breakdown of student-to-teacher ratios by year: Year Group FS1 FS2 – Y1 Y2 – Y6 Y7 – Y9 Y10 – Y11 Y12 – Y13 Maximum number of students 22 24 26 26 26 26 At the end of each academic year, it is the school’s policy to mix and reallocate all classes throughout the school. This process is undertaken to ensure the even spread of age, gender, nationality, and ability across the classes. What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm For detailed timings of all year groups,, please click here. What school transport is offered? What school transport is offered? A bus service is in operation at Sunmarke School. The details of this service, route and fees, are now available from the Transport Manager’s Office on the Ground Floor. For more information on bus fees, please click here. For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm Friday 12:15 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:30 pm onwards Friday 12.15 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:30 pm onwards Friday 12:15 pm onwards Further communication on this will be shared by our transportation department. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays Secondary Break 09:40am – 09:55am 9:40am – 9:55am Lunch 12:40pm – 01:40pm Not available Primary Key Stage 1 (Y1-2) Break 09:40am – 09:55pm 9:40am – 9:55am Lunch 10:50am – 11:45am Not available Primary Key Stage 2 (Y3- 6) Break 09:40am – 09:55am 9:40am – 9:55am Lunch 11:45am – 12:40pm Not available EYFS Break 09:40am – 09:55am Not available Lunch From 11:45am Not available 10. How do I pay for my child’s lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child’s lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child’s growth development. If your child doesn’t have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/for-parents/school-timings/",
    "title": "School Timings - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 1,
    "content": "School Timings - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login School Timings For Parents > School Timings School Timings Schedules For School Operations Below are our regular school timings for our Foundation Stage, Primary and Secondary school students: Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:30 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:30 am For detailed timings of all year groups,, please click here. Aftercare for enroled students is provided for FS1 to Year 2 up to 5 pm – please contact Admissions for more information.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/admissions/school-forms/#kingster-mobile-menu",
    "title": "School Forms - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "School Forms - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login School Forms Admissions > School Forms School Forms Sign Up For Your Child's Future 1 Admissions Recommendation Form – Primary Download 2 Admissions Recommendation Form – Secondary Download 3 DHA Student Medical History Form Download 4 DHA Student Medical History Form Arabic Download 5 Student Withdrawal Form Download 6 Transfer Certificate Template Download 7 Transport Agreement Download",
    "relevance_score": 0.35
  },
  {
    "url": "https://www.sunmarke.com/admissions/school-forms/#kingster-top-anchor",
    "title": "School Forms - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "School Forms - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login School Forms Admissions > School Forms School Forms Sign Up For Your Child's Future 1 Admissions Recommendation Form – Primary Download 2 Admissions Recommendation Form – Secondary Download 3 DHA Student Medical History Form Download 4 DHA Student Medical History Form Arabic Download 5 Student Withdrawal Form Download 6 Transfer Certificate Template Download 7 Transport Agreement Download",
    "relevance_score": 0.35
  },
  {
    "url": "https://www.sunmarke.com/admissions/faqs/#kingster-mobile-menu",
    "title": "FAQs - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "FAQs - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login FAQs Admissions > FAQs Frequently Asked Questions (FAQ’s) All You Want To Know About The School And Its Facilities We have compiled a list of questions that parents are most likely to ask us in the early stages of the application process – we hope you find it useful. Should you have any other questions, please get in touch with our Family Happiness Team and we will be happy to help. How do I enrol my child? Enrolment for 2024-25 – New families 1) Can I come in for a school tour with my family? Yes, we would be delighted to welcome you and your family for a school tour. It’s a great opportunity to experience the atmosphere and gain insight into our school. 2) KHDA Parent School Contract Please note that: Students can only attend school if they are registered in the KHDA School System, and parents have signed the Parent-School Contract. The school will register the student once all the relevant documents have been uploaded by the parents. This contract needs to be digitally signed only once – by parents of students who are new to the school. The contract is usually sent via sms on their local mobile phones registered with the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents required to complete the registration process: Latest School Reports School reference letter, if a report is not available Attested Transfer Certificate 1 Passport Size Coloured Photo (Student and both Parents) Student Passport Copy Sponsoring Parents Passport Copy Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy 4) Age Cut-Off Dates New students must be enrolled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. How do I book Assessments? Admissions are open year-round, with prorated fees available. We are booking assessments for FS1, FS2, Year 1 to 10, and Year 12. For students currently overseas, we can offer online assessments. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. Can my child be assessed before arriving in Dubai? Online Assessment Procedure: The assessment will take place at home under exam conditions via MS Teams. For Year 6 and below, we recommend adult supervision throughout. Ensure your child has a quiet, distraction-free workspace and the necessary equipment: a computer with internet, video, and audio capabilities. All other electronic devices should be switched off. You will receive an email with the meeting link. Please check access ahead of time and join at the scheduled time. Assistance is only allowed for setting up the meeting and login. Any interference during the assessment will invalidate the results. Assessment Checklist: Quiet, well-ventilated workspace. Computer with internet, video, and audio. All distractions (TV, phones, etc.) turned off. Microsoft Teams ready to join the meeting. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students - FS1 to Year 13 - 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in maths, literacy, and SEMH (social and emotional mental health). We currently offer an alternative curriculum pathway for Key Stages 3 and 4. 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, delivered by specialist teachers and LSAs. There is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSP cost. This will then be a separate invoice. 5. How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am For detailed EYFS timings click here For detailed Primary timings click here For detailed Secondary & Sixth Form timings click here What school transport is offered? What school transport is offered? Sunmarke uses an independent third party bus operator “My Bus Transport Services LLC” to make the school run as easy as possible. “My Bus” operates an air-conditioned and efficient transport service from various parts of Dubai to the school. Parents may avail of this service at their own discretion and cost. My Bus Transport Services manages the school transport operations. The details of services, route and fees, are now available from the Transport office. You can also find the details online, please click here . For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm onwards Friday 12:10 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:40 pm onwards Friday 12.10 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:40 pm onwards Friday 12:10 pm onwards Further communication related to pick-up and drop-off schedules will be shared by the transportation department upon successful registration and payment. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays EYFS Break 09:40 am – 09:55 am Not available Lunch Not available Not available Primary Key Stage 1 (Y1 - Y2) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 10:50 am – 11:45 am Not available Primary Key Stage 2 (Y3 - Y6) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 11:45 am – 12:40 pm Not available Secondary (Y7 - Y9 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 1:10 pm – 01:40 pm (Monday to Tuesday) 12:40 pm – 01:40 pm (Wednesday to Thursday) Not available Secondary (Y10 - Y13 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 12:40 pm – 01:40 pm (Monday to Tuesday) 01:10 pm – 01:40 pm (Wednesday to Thursday) Not available 10. How do I pay for my child's lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child's lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child's growth development. If your child doesn't have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies. How do I enrol my child? Enrolment for 2025-26 – New families 1) Can I come in for a school tour with my family? We are now able to conduct school tours for prospective students and their parents. 2) KHDA Parent School Contract To prepare for enrolment into the new academic year 2025-26, please note that: Students can only attend school in the new academic year if they are registered in the KHDA School System and parents have signed the Parent-School Contract. Please download the Dubai Now App which will enable you to sign the Parent/School Contract online. This only needs to be signed by parents of students who are new to the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school for 2025-26, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents that should be submitted to the school are: Letter of current enrolment at school (Year 2 Up) Transfer Certificate (Attested by UAE Embassy) School reference letter (Year 2 Up) School Reports – 2024-25 (Year 2 Up) 1 Passport Size Coloured Photo ( Student and both Parents) Student Passport Copy Student UAE Visa Copy Sponsoring Parents Passport and UAE Visa Copy Birth Certificate (in English or Arabic) Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy DHA Medical & Immunisation Consent form 4) Age Cut-Off Dates New students must be enroled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. What are the age requirements for AY 2024-25? 1. What are the changes to the age requirements for entry to Sunmarke School? Age requirements will change for new students enroled into FS1, according to the UAE Ministry of Education Resolution no (24). Children enroling into FS1, starting in September, must be three years old on or before the 31st of August. Children enroling into FS2, starting in September, must be four years old on or before the 31st of August. Similarly, children enroling into Year 1, starting school in September, must be five years old on or before the 31st of August. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. This includes students who enrol for the final term of the 2023/24 academic year. Schools that start the academic year in September, in line with MOE Resolution no (24). Year Group Age requirement Foundation Stage 1 3 years old by August 31st Foundation Stage 2 4 years old by August 31st Year 1 5 years old by August 31 Year 2 6 years old by August 31 2. When did this change come into effect? This change was applicable from the start of the 2021/22 academic year in September 2021. 3. Why was this change made? This decision was made to bring more consistency to the cut-off dates used by schools in the UAE with those used by schools abroad. For example, UK schools in the UAE will now have the same cut-off date as schools in the UK, and international British schools. 4.Who will this change impact? This change will impact children up to six years old who are enrolling in school for the first time. 5. Will the new cut-off date apply to all year groups? It will apply to new students enrolling in FS1, FS2, Year 1 and Year 2 in all schools in the UAE, as stipulated in the MOE resolution. 6. My child was born in October and is now in FS1 – I want to enrol him in another school for FS2. Can I do this or does he have to repeat a year? Because your child is already enroled in school, the new cut-off dates in the MOE resolution do not apply. He does not have to repeat the year. 7. My son was enroled in FS1 this year but I withdrew his enrolment due to COVID-19. He’ll be 3 years old in September. Can I still enrol him in FS2 next year? Your child must have formally finished the previous academic year in order to enrol in the next one. Since he does not meet the age requirement for FS2 for next academic year, he must enrol in FS1. According to the MOE resolution, he can enrol in FS2 next academic year only if he completes FS1 this academic year. 8. My daughter will be 4 years old in December. If I enrol her in FS2 for the last term of this year – before the changes come into effect – will she be able to start Year 1 next year? Yes. The new age requirements will apply for new students from the start of the next academic year only. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. 9. I’ve already registered and paid the deposit for my daughter to start school in FS2 in September. She will be four years old in November. Is she affected by this? According to the new cut-off dates in the MOE resolution, your daughter will not be able to start in FS2 in September. Alternatively, we would be happy to transfer your child’s application to their age-appropriate year group (FS1) and register your child for this year group instead. Parents whose children are affected by the new cut-off dates and who have already paid deposits for their children’s enrolment are entitled to a refund if they wish. 10. My child was born one day after the cut-off date. Is there some leeway given? No exceptions to the cut-off dates will be given under any circumstances How do I book Assessments for entry 2025-26 AY? Admissions are now open for applications for 2025-26 AY* entry. The 2025-2026 Assessment Diary is Open – We are now booking assessments for year groups FS1 & FS2, Year 1 to 10 and Year 12. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. For students currently overseas: For students in current Year 6 and above we can offer Assessment at the current school attended. Please contact us to find out more. Students transferring from UK schools in all years, please contact us directly for more details. Can my child be assessed before arriving into Dubai? For Students entering Year 7 and above, assessment can be offered at the current school attended if that school is willing to administer the test under examination conditions. The assessment will be the same as that taken by our local students with the addition of a Skype interview. You will need to provide registration, a letter of enrolment, the latest school report, and a recommendation form by the date of assessment. For students transferring from UK schools please contact admissions directly to discuss your application. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students – FS1 to Year 13 – 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in language, maths, literacy, and functional independence. We are currently working to develop our range of alternative curriculum pathways for Key Stages 2, 3, and 4 so that, in time, we can offer an appropriate pathway for every learner. What is Year 7 and Year 8 Life skills Pathway? 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, supplemented by ASDAN modules. As it is a supplemented curriculum which focuses on reduced teachers, as per KHDA, there is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSA cost. This will then be a separate invoice. 5 How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. For more information on the pathway, please click here What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? Students transferring to Sunmarke School from Regent International School, will not be required to pay additional Assessment or Registration fees. Transferring students are only required to complete the RIS Re-Enrollment Form and pay the 5 % re-enrolment fee by the start of the third term each year to secure their seat. What are the tuition fees and discounts for Regent International School transfers to Sunmarke school for FS1-Year 13 (2025-26)? Fee Structure – Transferring students from Regent International School to Sunmarke School Application Fee Dhs.525/- – Not chargeable Re-enrollment Fee (Existing Students) 5% of Tuition Fee – Non-refundable, adjusted against the 1st Term’s Tuition Fee, 1st day of Term3 Transferring RIS Students Phase Tuition Fees Year Group Discounted Tuition Fees for students transferring from Year 6 at Regent Foundation 1 46,700 Foundation 2 51,900 Year 1 58,548 Year 2 58,548 Year 3 59,619 Year 4 59,619 Year 5 59,619 Year 6 59,619 Year 7 67,290 Year 8 67,290 Year 9 67,290 Year 10 69,397 Year 11 69,397 Year 12 70,276 Year 13 70,276 Additional Benefits: Sibling Discounts: 1st Sibling 5%, 2nd Sibling 10%, 3rd Sibling 10%, 4th Sibling 10%. The sibling discount scheme is available to those siblings from the same family who enrol at the school for one full academic year. The sibling discount is applicable to the 2nd, 3rd, 4th and 5th child from the same family. The amount of the discount is calculated off the actual Tuition Fee paid of the child who pays the lowest tuition fee amongst the siblings enrolled at the school. The maximum discount per family cannot exceed 35% of the lowest paying sibling’s Tuition Fee. SCHOOL ACCOUNT DETAILS TUITION FEES – DUE DATES Payment can be made via wire transfer to the following account: Re-enrolment 15 th December Account Name : SUNMARKE SCHOOL LLC Autumn Term 01 st August Account Number : 12000921414 Spring Term 15 th November Bank Name : National Bank of Fujairah PJSC Summer Term 15 th February Branch : Jebel Ali Swift : NBFUAEAFDXB IBAN # : AE220380000012000921414 Remarks : Please email proof of all payments to: accounts.sms@sunmarkedubai.com , and cc: officemanager.sms@forteseducation.com & registrar.sms@forteseducation.com Additional Fees (charged separately from Tuition Fee): Optional Transportation Services via 3rd Party Service Provider; Optional Dining Services via 3rd Party Service Provider; Optional After-School Activities provided by 3 rd Party Service Providers; School Uniforms; Educational Visits; School Fees are subject to change in accordance with the Knowledge and Human Development Authority (KHDA) Fees Framework What are the sibling discounts if siblings are at both Sunmarke School and Regent International School for 2025-26? In cases where the eldest sibling transfers to the secondary phase at Sunmarke School, but the FS and Primary Phase siblings stay at Regent International School the following discount policy will be applied on full-year attendance: Example 1: Eldest Child (1st Child in the family) – Attending Sunmarke: No Discount 2nd Child from the same family (Sibling 1 at SMS): 5% deducted from 3rd Term Tuition fee as per SMS Policy 3rd Child from the same family (Sibling 2 at SMS): 10% deducted from 3rd Term Tuition fee as per SMS Policy 4th Child from the same family (Sibling 3 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy 5th Child from the same family (Sibling 4 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy Example 2: Eldest Child (1st Child in the family) – Attending Sunmarke School: No Discount 2nd Child from the same family (Sibling 1 at RIS): 5% deducted from 3rd Term Tuition fee as per RIS Policy 3rd Child from the same family (Sibling 2 at RIS): 10% deducted from 3rd Term Tuition fee as per RIS Policy 4th Child from the same family (Sibling 3 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy 5th Child from the same family (Sibling 4 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy *Please note, that these discounts will be applied to the 1st, 2nd, 3rd or 4th siblings 3rd Term of joining actual Tuition Fee. The maximum discount per family is equal to 35% of the lowest sibling’s tuition fee. What is the Sunmarke School and Regent International School returning students -Founders Fee entitlement? If a Regent International School or Sunmarke School student leaves the school but returns to the School before the end of one (1) academic term, they will keep their entitlement to the Regent International School Transfers to Sunmarke School Tuition Fee Structure. If more than one Term passes, then the student will be considered a New Student and will be required to pay the New Students Fee Structure as applicable to their group of re-entry. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What is the class capacity? Class Sizes for Academic Year 2025-26: To ensure each student receives the individualised care he/she deserves, we cap classes based on the year. Below is a breakdown of student-to-teacher ratios by year: Year Group FS1 FS2 – Y1 Y2 – Y6 Y7 – Y9 Y10 – Y11 Y12 – Y13 Maximum number of students 22 24 26 26 26 26 At the end of each academic year, it is the school’s policy to mix and reallocate all classes throughout the school. This process is undertaken to ensure the even spread of age, gender, nationality, and ability across the classes. What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm For detailed timings of all year groups,, please click here. What school transport is offered? What school transport is offered? A bus service is in operation at Sunmarke School. The details of this service, route and fees, are now available from the Transport Manager’s Office on the Ground Floor. For more information on bus fees, please click here. For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm Friday 12:15 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:30 pm onwards Friday 12.15 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:30 pm onwards Friday 12:15 pm onwards Further communication on this will be shared by our transportation department. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays Secondary Break 09:40am – 09:55am 9:40am – 9:55am Lunch 12:40pm – 01:40pm Not available Primary Key Stage 1 (Y1-2) Break 09:40am – 09:55pm 9:40am – 9:55am Lunch 10:50am – 11:45am Not available Primary Key Stage 2 (Y3- 6) Break 09:40am – 09:55am 9:40am – 9:55am Lunch 11:45am – 12:40pm Not available EYFS Break 09:40am – 09:55am Not available Lunch From 11:45am Not available 10. How do I pay for my child’s lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child’s lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child’s growth development. If your child doesn’t have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/admissions/faqs/#kingster-top-anchor",
    "title": "FAQs - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "FAQs - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login FAQs Admissions > FAQs Frequently Asked Questions (FAQ’s) All You Want To Know About The School And Its Facilities We have compiled a list of questions that parents are most likely to ask us in the early stages of the application process – we hope you find it useful. Should you have any other questions, please get in touch with our Family Happiness Team and we will be happy to help. How do I enrol my child? Enrolment for 2024-25 – New families 1) Can I come in for a school tour with my family? Yes, we would be delighted to welcome you and your family for a school tour. It’s a great opportunity to experience the atmosphere and gain insight into our school. 2) KHDA Parent School Contract Please note that: Students can only attend school if they are registered in the KHDA School System, and parents have signed the Parent-School Contract. The school will register the student once all the relevant documents have been uploaded by the parents. This contract needs to be digitally signed only once – by parents of students who are new to the school. The contract is usually sent via sms on their local mobile phones registered with the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents required to complete the registration process: Latest School Reports School reference letter, if a report is not available Attested Transfer Certificate 1 Passport Size Coloured Photo (Student and both Parents) Student Passport Copy Sponsoring Parents Passport Copy Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy 4) Age Cut-Off Dates New students must be enrolled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. How do I book Assessments? Admissions are open year-round, with prorated fees available. We are booking assessments for FS1, FS2, Year 1 to 10, and Year 12. For students currently overseas, we can offer online assessments. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. Can my child be assessed before arriving in Dubai? Online Assessment Procedure: The assessment will take place at home under exam conditions via MS Teams. For Year 6 and below, we recommend adult supervision throughout. Ensure your child has a quiet, distraction-free workspace and the necessary equipment: a computer with internet, video, and audio capabilities. All other electronic devices should be switched off. You will receive an email with the meeting link. Please check access ahead of time and join at the scheduled time. Assistance is only allowed for setting up the meeting and login. Any interference during the assessment will invalidate the results. Assessment Checklist: Quiet, well-ventilated workspace. Computer with internet, video, and audio. All distractions (TV, phones, etc.) turned off. Microsoft Teams ready to join the meeting. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students - FS1 to Year 13 - 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in maths, literacy, and SEMH (social and emotional mental health). We currently offer an alternative curriculum pathway for Key Stages 3 and 4. 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, delivered by specialist teachers and LSAs. There is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSP cost. This will then be a separate invoice. 5. How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am For detailed EYFS timings click here For detailed Primary timings click here For detailed Secondary & Sixth Form timings click here What school transport is offered? What school transport is offered? Sunmarke uses an independent third party bus operator “My Bus Transport Services LLC” to make the school run as easy as possible. “My Bus” operates an air-conditioned and efficient transport service from various parts of Dubai to the school. Parents may avail of this service at their own discretion and cost. My Bus Transport Services manages the school transport operations. The details of services, route and fees, are now available from the Transport office. You can also find the details online, please click here . For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm onwards Friday 12:10 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:40 pm onwards Friday 12.10 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:40 pm onwards Friday 12:10 pm onwards Further communication related to pick-up and drop-off schedules will be shared by the transportation department upon successful registration and payment. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays EYFS Break 09:40 am – 09:55 am Not available Lunch Not available Not available Primary Key Stage 1 (Y1 - Y2) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 10:50 am – 11:45 am Not available Primary Key Stage 2 (Y3 - Y6) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 11:45 am – 12:40 pm Not available Secondary (Y7 - Y9 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 1:10 pm – 01:40 pm (Monday to Tuesday) 12:40 pm – 01:40 pm (Wednesday to Thursday) Not available Secondary (Y10 - Y13 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 12:40 pm – 01:40 pm (Monday to Tuesday) 01:10 pm – 01:40 pm (Wednesday to Thursday) Not available 10. How do I pay for my child's lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child's lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child's growth development. If your child doesn't have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies. How do I enrol my child? Enrolment for 2025-26 – New families 1) Can I come in for a school tour with my family? We are now able to conduct school tours for prospective students and their parents. 2) KHDA Parent School Contract To prepare for enrolment into the new academic year 2025-26, please note that: Students can only attend school in the new academic year if they are registered in the KHDA School System and parents have signed the Parent-School Contract. Please download the Dubai Now App which will enable you to sign the Parent/School Contract online. This only needs to be signed by parents of students who are new to the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school for 2025-26, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents that should be submitted to the school are: Letter of current enrolment at school (Year 2 Up) Transfer Certificate (Attested by UAE Embassy) School reference letter (Year 2 Up) School Reports – 2024-25 (Year 2 Up) 1 Passport Size Coloured Photo ( Student and both Parents) Student Passport Copy Student UAE Visa Copy Sponsoring Parents Passport and UAE Visa Copy Birth Certificate (in English or Arabic) Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy DHA Medical & Immunisation Consent form 4) Age Cut-Off Dates New students must be enroled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. What are the age requirements for AY 2024-25? 1. What are the changes to the age requirements for entry to Sunmarke School? Age requirements will change for new students enroled into FS1, according to the UAE Ministry of Education Resolution no (24). Children enroling into FS1, starting in September, must be three years old on or before the 31st of August. Children enroling into FS2, starting in September, must be four years old on or before the 31st of August. Similarly, children enroling into Year 1, starting school in September, must be five years old on or before the 31st of August. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. This includes students who enrol for the final term of the 2023/24 academic year. Schools that start the academic year in September, in line with MOE Resolution no (24). Year Group Age requirement Foundation Stage 1 3 years old by August 31st Foundation Stage 2 4 years old by August 31st Year 1 5 years old by August 31 Year 2 6 years old by August 31 2. When did this change come into effect? This change was applicable from the start of the 2021/22 academic year in September 2021. 3. Why was this change made? This decision was made to bring more consistency to the cut-off dates used by schools in the UAE with those used by schools abroad. For example, UK schools in the UAE will now have the same cut-off date as schools in the UK, and international British schools. 4.Who will this change impact? This change will impact children up to six years old who are enrolling in school for the first time. 5. Will the new cut-off date apply to all year groups? It will apply to new students enrolling in FS1, FS2, Year 1 and Year 2 in all schools in the UAE, as stipulated in the MOE resolution. 6. My child was born in October and is now in FS1 – I want to enrol him in another school for FS2. Can I do this or does he have to repeat a year? Because your child is already enroled in school, the new cut-off dates in the MOE resolution do not apply. He does not have to repeat the year. 7. My son was enroled in FS1 this year but I withdrew his enrolment due to COVID-19. He’ll be 3 years old in September. Can I still enrol him in FS2 next year? Your child must have formally finished the previous academic year in order to enrol in the next one. Since he does not meet the age requirement for FS2 for next academic year, he must enrol in FS1. According to the MOE resolution, he can enrol in FS2 next academic year only if he completes FS1 this academic year. 8. My daughter will be 4 years old in December. If I enrol her in FS2 for the last term of this year – before the changes come into effect – will she be able to start Year 1 next year? Yes. The new age requirements will apply for new students from the start of the next academic year only. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. 9. I’ve already registered and paid the deposit for my daughter to start school in FS2 in September. She will be four years old in November. Is she affected by this? According to the new cut-off dates in the MOE resolution, your daughter will not be able to start in FS2 in September. Alternatively, we would be happy to transfer your child’s application to their age-appropriate year group (FS1) and register your child for this year group instead. Parents whose children are affected by the new cut-off dates and who have already paid deposits for their children’s enrolment are entitled to a refund if they wish. 10. My child was born one day after the cut-off date. Is there some leeway given? No exceptions to the cut-off dates will be given under any circumstances How do I book Assessments for entry 2025-26 AY? Admissions are now open for applications for 2025-26 AY* entry. The 2025-2026 Assessment Diary is Open – We are now booking assessments for year groups FS1 & FS2, Year 1 to 10 and Year 12. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. For students currently overseas: For students in current Year 6 and above we can offer Assessment at the current school attended. Please contact us to find out more. Students transferring from UK schools in all years, please contact us directly for more details. Can my child be assessed before arriving into Dubai? For Students entering Year 7 and above, assessment can be offered at the current school attended if that school is willing to administer the test under examination conditions. The assessment will be the same as that taken by our local students with the addition of a Skype interview. You will need to provide registration, a letter of enrolment, the latest school report, and a recommendation form by the date of assessment. For students transferring from UK schools please contact admissions directly to discuss your application. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students – FS1 to Year 13 – 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in language, maths, literacy, and functional independence. We are currently working to develop our range of alternative curriculum pathways for Key Stages 2, 3, and 4 so that, in time, we can offer an appropriate pathway for every learner. What is Year 7 and Year 8 Life skills Pathway? 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, supplemented by ASDAN modules. As it is a supplemented curriculum which focuses on reduced teachers, as per KHDA, there is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSA cost. This will then be a separate invoice. 5 How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. For more information on the pathway, please click here What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? Students transferring to Sunmarke School from Regent International School, will not be required to pay additional Assessment or Registration fees. Transferring students are only required to complete the RIS Re-Enrollment Form and pay the 5 % re-enrolment fee by the start of the third term each year to secure their seat. What are the tuition fees and discounts for Regent International School transfers to Sunmarke school for FS1-Year 13 (2025-26)? Fee Structure – Transferring students from Regent International School to Sunmarke School Application Fee Dhs.525/- – Not chargeable Re-enrollment Fee (Existing Students) 5% of Tuition Fee – Non-refundable, adjusted against the 1st Term’s Tuition Fee, 1st day of Term3 Transferring RIS Students Phase Tuition Fees Year Group Discounted Tuition Fees for students transferring from Year 6 at Regent Foundation 1 46,700 Foundation 2 51,900 Year 1 58,548 Year 2 58,548 Year 3 59,619 Year 4 59,619 Year 5 59,619 Year 6 59,619 Year 7 67,290 Year 8 67,290 Year 9 67,290 Year 10 69,397 Year 11 69,397 Year 12 70,276 Year 13 70,276 Additional Benefits: Sibling Discounts: 1st Sibling 5%, 2nd Sibling 10%, 3rd Sibling 10%, 4th Sibling 10%. The sibling discount scheme is available to those siblings from the same family who enrol at the school for one full academic year. The sibling discount is applicable to the 2nd, 3rd, 4th and 5th child from the same family. The amount of the discount is calculated off the actual Tuition Fee paid of the child who pays the lowest tuition fee amongst the siblings enrolled at the school. The maximum discount per family cannot exceed 35% of the lowest paying sibling’s Tuition Fee. SCHOOL ACCOUNT DETAILS TUITION FEES – DUE DATES Payment can be made via wire transfer to the following account: Re-enrolment 15 th December Account Name : SUNMARKE SCHOOL LLC Autumn Term 01 st August Account Number : 12000921414 Spring Term 15 th November Bank Name : National Bank of Fujairah PJSC Summer Term 15 th February Branch : Jebel Ali Swift : NBFUAEAFDXB IBAN # : AE220380000012000921414 Remarks : Please email proof of all payments to: accounts.sms@sunmarkedubai.com , and cc: officemanager.sms@forteseducation.com & registrar.sms@forteseducation.com Additional Fees (charged separately from Tuition Fee): Optional Transportation Services via 3rd Party Service Provider; Optional Dining Services via 3rd Party Service Provider; Optional After-School Activities provided by 3 rd Party Service Providers; School Uniforms; Educational Visits; School Fees are subject to change in accordance with the Knowledge and Human Development Authority (KHDA) Fees Framework What are the sibling discounts if siblings are at both Sunmarke School and Regent International School for 2025-26? In cases where the eldest sibling transfers to the secondary phase at Sunmarke School, but the FS and Primary Phase siblings stay at Regent International School the following discount policy will be applied on full-year attendance: Example 1: Eldest Child (1st Child in the family) – Attending Sunmarke: No Discount 2nd Child from the same family (Sibling 1 at SMS): 5% deducted from 3rd Term Tuition fee as per SMS Policy 3rd Child from the same family (Sibling 2 at SMS): 10% deducted from 3rd Term Tuition fee as per SMS Policy 4th Child from the same family (Sibling 3 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy 5th Child from the same family (Sibling 4 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy Example 2: Eldest Child (1st Child in the family) – Attending Sunmarke School: No Discount 2nd Child from the same family (Sibling 1 at RIS): 5% deducted from 3rd Term Tuition fee as per RIS Policy 3rd Child from the same family (Sibling 2 at RIS): 10% deducted from 3rd Term Tuition fee as per RIS Policy 4th Child from the same family (Sibling 3 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy 5th Child from the same family (Sibling 4 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy *Please note, that these discounts will be applied to the 1st, 2nd, 3rd or 4th siblings 3rd Term of joining actual Tuition Fee. The maximum discount per family is equal to 35% of the lowest sibling’s tuition fee. What is the Sunmarke School and Regent International School returning students -Founders Fee entitlement? If a Regent International School or Sunmarke School student leaves the school but returns to the School before the end of one (1) academic term, they will keep their entitlement to the Regent International School Transfers to Sunmarke School Tuition Fee Structure. If more than one Term passes, then the student will be considered a New Student and will be required to pay the New Students Fee Structure as applicable to their group of re-entry. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What is the class capacity? Class Sizes for Academic Year 2025-26: To ensure each student receives the individualised care he/she deserves, we cap classes based on the year. Below is a breakdown of student-to-teacher ratios by year: Year Group FS1 FS2 – Y1 Y2 – Y6 Y7 – Y9 Y10 – Y11 Y12 – Y13 Maximum number of students 22 24 26 26 26 26 At the end of each academic year, it is the school’s policy to mix and reallocate all classes throughout the school. This process is undertaken to ensure the even spread of age, gender, nationality, and ability across the classes. What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm For detailed timings of all year groups,, please click here. What school transport is offered? What school transport is offered? A bus service is in operation at Sunmarke School. The details of this service, route and fees, are now available from the Transport Manager’s Office on the Ground Floor. For more information on bus fees, please click here. For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm Friday 12:15 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:30 pm onwards Friday 12.15 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:30 pm onwards Friday 12:15 pm onwards Further communication on this will be shared by our transportation department. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays Secondary Break 09:40am – 09:55am 9:40am – 9:55am Lunch 12:40pm – 01:40pm Not available Primary Key Stage 1 (Y1-2) Break 09:40am – 09:55pm 9:40am – 9:55am Lunch 10:50am – 11:45am Not available Primary Key Stage 2 (Y3- 6) Break 09:40am – 09:55am 9:40am – 9:55am Lunch 11:45am – 12:40pm Not available EYFS Break 09:40am – 09:55am Not available Lunch From 11:45am Not available 10. How do I pay for my child’s lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child’s lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child’s growth development. If your child doesn’t have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/for-parents/school-timings/#kingster-mobile-menu",
    "title": "School Timings - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "School Timings - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login School Timings For Parents > School Timings School Timings Schedules For School Operations Below are our regular school timings for our Foundation Stage, Primary and Secondary school students: Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:30 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:30 am For detailed timings of all year groups,, please click here. Aftercare for enroled students is provided for FS1 to Year 2 up to 5 pm – please contact Admissions for more information.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/for-parents/school-timings/#kingster-top-anchor",
    "title": "School Timings - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "School Timings - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login School Timings For Parents > School Timings School Timings Schedules For School Operations Below are our regular school timings for our Foundation Stage, Primary and Secondary school students: Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:30 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:30 am For detailed timings of all year groups,, please click here. Aftercare for enroled students is provided for FS1 to Year 2 up to 5 pm – please contact Admissions for more information.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/school-calendar-events/list/?eventDisplay=past",
    "title": "Past Events from May 4, 2023 – March 27, 2023 – Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "Past Events from May 4, 2023 – March 27, 2023 – Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Events 15 events found. School Events Calendar 2025-2026 July 2024 Fri 5 August 2024 Thu 15 October 2024 Wed 2 November 2024 Thu 7 Tue 12 Fri 15 Wed 27 Thu 28 December 2024 Wed 4 Thu 5 Fri 6 Thu 12 January 2025 Tue 14 Thu 23 Thu 30 Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file",
    "relevance_score": 0.352
  },
  {
    "url": "https://www.sunmarke.com/faqs/",
    "title": "FAQs - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 2,
    "content": "FAQs - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login FAQs Admissions > FAQs Frequently Asked Questions (FAQ’s) All You Want To Know About The School And Its Facilities We have compiled a list of questions that parents are most likely to ask us in the early stages of the application process – we hope you find it useful. Should you have any other questions, please get in touch with our Family Happiness Team and we will be happy to help. How do I enrol my child? Enrolment for 2024-25 – New families 1) Can I come in for a school tour with my family? Yes, we would be delighted to welcome you and your family for a school tour. It’s a great opportunity to experience the atmosphere and gain insight into our school. 2) KHDA Parent School Contract Please note that: Students can only attend school if they are registered in the KHDA School System, and parents have signed the Parent-School Contract. The school will register the student once all the relevant documents have been uploaded by the parents. This contract needs to be digitally signed only once – by parents of students who are new to the school. The contract is usually sent via sms on their local mobile phones registered with the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents required to complete the registration process: Latest School Reports School reference letter, if a report is not available Attested Transfer Certificate 1 Passport Size Coloured Photo (Student and both Parents) Student Passport Copy Sponsoring Parents Passport Copy Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy 4) Age Cut-Off Dates New students must be enrolled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. How do I book Assessments? Admissions are open year-round, with prorated fees available. We are booking assessments for FS1, FS2, Year 1 to 10, and Year 12. For students currently overseas, we can offer online assessments. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. Can my child be assessed before arriving in Dubai? Online Assessment Procedure: The assessment will take place at home under exam conditions via MS Teams. For Year 6 and below, we recommend adult supervision throughout. Ensure your child has a quiet, distraction-free workspace and the necessary equipment: a computer with internet, video, and audio capabilities. All other electronic devices should be switched off. You will receive an email with the meeting link. Please check access ahead of time and join at the scheduled time. Assistance is only allowed for setting up the meeting and login. Any interference during the assessment will invalidate the results. Assessment Checklist: Quiet, well-ventilated workspace. Computer with internet, video, and audio. All distractions (TV, phones, etc.) turned off. Microsoft Teams ready to join the meeting. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students - FS1 to Year 13 - 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in maths, literacy, and SEMH (social and emotional mental health). We currently offer an alternative curriculum pathway for Key Stages 3 and 4. 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, delivered by specialist teachers and LSAs. There is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSP cost. This will then be a separate invoice. 5. How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am For detailed EYFS timings click here For detailed Primary timings click here For detailed Secondary & Sixth Form timings click here What school transport is offered? What school transport is offered? Sunmarke uses an independent third party bus operator “My Bus Transport Services LLC” to make the school run as easy as possible. “My Bus” operates an air-conditioned and efficient transport service from various parts of Dubai to the school. Parents may avail of this service at their own discretion and cost. My Bus Transport Services manages the school transport operations. The details of services, route and fees, are now available from the Transport office. You can also find the details online, please click here . For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm onwards Friday 12:10 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:40 pm onwards Friday 12.10 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:40 pm onwards Friday 12:10 pm onwards Further communication related to pick-up and drop-off schedules will be shared by the transportation department upon successful registration and payment. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays EYFS Break 09:40 am – 09:55 am Not available Lunch Not available Not available Primary Key Stage 1 (Y1 - Y2) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 10:50 am – 11:45 am Not available Primary Key Stage 2 (Y3 - Y6) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 11:45 am – 12:40 pm Not available Secondary (Y7 - Y9 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 1:10 pm – 01:40 pm (Monday to Tuesday) 12:40 pm – 01:40 pm (Wednesday to Thursday) Not available Secondary (Y10 - Y13 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 12:40 pm – 01:40 pm (Monday to Tuesday) 01:10 pm – 01:40 pm (Wednesday to Thursday) Not available 10. How do I pay for my child's lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child's lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child's growth development. If your child doesn't have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies. How do I enrol my child? Enrolment for 2025-26 – New families 1) Can I come in for a school tour with my family? We are now able to conduct school tours for prospective students and their parents. 2) KHDA Parent School Contract To prepare for enrolment into the new academic year 2025-26, please note that: Students can only attend school in the new academic year if they are registered in the KHDA School System and parents have signed the Parent-School Contract. Please download the Dubai Now App which will enable you to sign the Parent/School Contract online. This only needs to be signed by parents of students who are new to the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school for 2025-26, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents that should be submitted to the school are: Letter of current enrolment at school (Year 2 Up) Transfer Certificate (Attested by UAE Embassy) School reference letter (Year 2 Up) School Reports – 2024-25 (Year 2 Up) 1 Passport Size Coloured Photo ( Student and both Parents) Student Passport Copy Student UAE Visa Copy Sponsoring Parents Passport and UAE Visa Copy Birth Certificate (in English or Arabic) Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy DHA Medical & Immunisation Consent form 4) Age Cut-Off Dates New students must be enroled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. What are the age requirements for AY 2024-25? 1. What are the changes to the age requirements for entry to Sunmarke School? Age requirements will change for new students enroled into FS1, according to the UAE Ministry of Education Resolution no (24). Children enroling into FS1, starting in September, must be three years old on or before the 31st of August. Children enroling into FS2, starting in September, must be four years old on or before the 31st of August. Similarly, children enroling into Year 1, starting school in September, must be five years old on or before the 31st of August. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. This includes students who enrol for the final term of the 2023/24 academic year. Schools that start the academic year in September, in line with MOE Resolution no (24). Year Group Age requirement Foundation Stage 1 3 years old by August 31st Foundation Stage 2 4 years old by August 31st Year 1 5 years old by August 31 Year 2 6 years old by August 31 2. When did this change come into effect? This change was applicable from the start of the 2021/22 academic year in September 2021. 3. Why was this change made? This decision was made to bring more consistency to the cut-off dates used by schools in the UAE with those used by schools abroad. For example, UK schools in the UAE will now have the same cut-off date as schools in the UK, and international British schools. 4.Who will this change impact? This change will impact children up to six years old who are enrolling in school for the first time. 5. Will the new cut-off date apply to all year groups? It will apply to new students enrolling in FS1, FS2, Year 1 and Year 2 in all schools in the UAE, as stipulated in the MOE resolution. 6. My child was born in October and is now in FS1 – I want to enrol him in another school for FS2. Can I do this or does he have to repeat a year? Because your child is already enroled in school, the new cut-off dates in the MOE resolution do not apply. He does not have to repeat the year. 7. My son was enroled in FS1 this year but I withdrew his enrolment due to COVID-19. He’ll be 3 years old in September. Can I still enrol him in FS2 next year? Your child must have formally finished the previous academic year in order to enrol in the next one. Since he does not meet the age requirement for FS2 for next academic year, he must enrol in FS1. According to the MOE resolution, he can enrol in FS2 next academic year only if he completes FS1 this academic year. 8. My daughter will be 4 years old in December. If I enrol her in FS2 for the last term of this year – before the changes come into effect – will she be able to start Year 1 next year? Yes. The new age requirements will apply for new students from the start of the next academic year only. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. 9. I’ve already registered and paid the deposit for my daughter to start school in FS2 in September. She will be four years old in November. Is she affected by this? According to the new cut-off dates in the MOE resolution, your daughter will not be able to start in FS2 in September. Alternatively, we would be happy to transfer your child’s application to their age-appropriate year group (FS1) and register your child for this year group instead. Parents whose children are affected by the new cut-off dates and who have already paid deposits for their children’s enrolment are entitled to a refund if they wish. 10. My child was born one day after the cut-off date. Is there some leeway given? No exceptions to the cut-off dates will be given under any circumstances How do I book Assessments for entry 2025-26 AY? Admissions are now open for applications for 2025-26 AY* entry. The 2025-2026 Assessment Diary is Open – We are now booking assessments for year groups FS1 & FS2, Year 1 to 10 and Year 12. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. For students currently overseas: For students in current Year 6 and above we can offer Assessment at the current school attended. Please contact us to find out more. Students transferring from UK schools in all years, please contact us directly for more details. Can my child be assessed before arriving into Dubai? For Students entering Year 7 and above, assessment can be offered at the current school attended if that school is willing to administer the test under examination conditions. The assessment will be the same as that taken by our local students with the addition of a Skype interview. You will need to provide registration, a letter of enrolment, the latest school report, and a recommendation form by the date of assessment. For students transferring from UK schools please contact admissions directly to discuss your application. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students – FS1 to Year 13 – 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in language, maths, literacy, and functional independence. We are currently working to develop our range of alternative curriculum pathways for Key Stages 2, 3, and 4 so that, in time, we can offer an appropriate pathway for every learner. What is Year 7 and Year 8 Life skills Pathway? 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, supplemented by ASDAN modules. As it is a supplemented curriculum which focuses on reduced teachers, as per KHDA, there is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSA cost. This will then be a separate invoice. 5 How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. For more information on the pathway, please click here What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? Students transferring to Sunmarke School from Regent International School, will not be required to pay additional Assessment or Registration fees. Transferring students are only required to complete the RIS Re-Enrollment Form and pay the 5 % re-enrolment fee by the start of the third term each year to secure their seat. What are the tuition fees and discounts for Regent International School transfers to Sunmarke school for FS1-Year 13 (2025-26)? Fee Structure – Transferring students from Regent International School to Sunmarke School Application Fee Dhs.525/- – Not chargeable Re-enrollment Fee (Existing Students) 5% of Tuition Fee – Non-refundable, adjusted against the 1st Term’s Tuition Fee, 1st day of Term3 Transferring RIS Students Phase Tuition Fees Year Group Discounted Tuition Fees for students transferring from Year 6 at Regent Foundation 1 46,700 Foundation 2 51,900 Year 1 58,548 Year 2 58,548 Year 3 59,619 Year 4 59,619 Year 5 59,619 Year 6 59,619 Year 7 67,290 Year 8 67,290 Year 9 67,290 Year 10 69,397 Year 11 69,397 Year 12 70,276 Year 13 70,276 Additional Benefits: Sibling Discounts: 1st Sibling 5%, 2nd Sibling 10%, 3rd Sibling 10%, 4th Sibling 10%. The sibling discount scheme is available to those siblings from the same family who enrol at the school for one full academic year. The sibling discount is applicable to the 2nd, 3rd, 4th and 5th child from the same family. The amount of the discount is calculated off the actual Tuition Fee paid of the child who pays the lowest tuition fee amongst the siblings enrolled at the school. The maximum discount per family cannot exceed 35% of the lowest paying sibling’s Tuition Fee. SCHOOL ACCOUNT DETAILS TUITION FEES – DUE DATES Payment can be made via wire transfer to the following account: Re-enrolment 15 th December Account Name : SUNMARKE SCHOOL LLC Autumn Term 01 st August Account Number : 12000921414 Spring Term 15 th November Bank Name : National Bank of Fujairah PJSC Summer Term 15 th February Branch : Jebel Ali Swift : NBFUAEAFDXB IBAN # : AE220380000012000921414 Remarks : Please email proof of all payments to: accounts.sms@sunmarkedubai.com , and cc: officemanager.sms@forteseducation.com & registrar.sms@forteseducation.com Additional Fees (charged separately from Tuition Fee): Optional Transportation Services via 3rd Party Service Provider; Optional Dining Services via 3rd Party Service Provider; Optional After-School Activities provided by 3 rd Party Service Providers; School Uniforms; Educational Visits; School Fees are subject to change in accordance with the Knowledge and Human Development Authority (KHDA) Fees Framework What are the sibling discounts if siblings are at both Sunmarke School and Regent International School for 2025-26? In cases where the eldest sibling transfers to the secondary phase at Sunmarke School, but the FS and Primary Phase siblings stay at Regent International School the following discount policy will be applied on full-year attendance: Example 1: Eldest Child (1st Child in the family) – Attending Sunmarke: No Discount 2nd Child from the same family (Sibling 1 at SMS): 5% deducted from 3rd Term Tuition fee as per SMS Policy 3rd Child from the same family (Sibling 2 at SMS): 10% deducted from 3rd Term Tuition fee as per SMS Policy 4th Child from the same family (Sibling 3 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy 5th Child from the same family (Sibling 4 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy Example 2: Eldest Child (1st Child in the family) – Attending Sunmarke School: No Discount 2nd Child from the same family (Sibling 1 at RIS): 5% deducted from 3rd Term Tuition fee as per RIS Policy 3rd Child from the same family (Sibling 2 at RIS): 10% deducted from 3rd Term Tuition fee as per RIS Policy 4th Child from the same family (Sibling 3 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy 5th Child from the same family (Sibling 4 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy *Please note, that these discounts will be applied to the 1st, 2nd, 3rd or 4th siblings 3rd Term of joining actual Tuition Fee. The maximum discount per family is equal to 35% of the lowest sibling’s tuition fee. What is the Sunmarke School and Regent International School returning students -Founders Fee entitlement? If a Regent International School or Sunmarke School student leaves the school but returns to the School before the end of one (1) academic term, they will keep their entitlement to the Regent International School Transfers to Sunmarke School Tuition Fee Structure. If more than one Term passes, then the student will be considered a New Student and will be required to pay the New Students Fee Structure as applicable to their group of re-entry. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What is the class capacity? Class Sizes for Academic Year 2025-26: To ensure each student receives the individualised care he/she deserves, we cap classes based on the year. Below is a breakdown of student-to-teacher ratios by year: Year Group FS1 FS2 – Y1 Y2 – Y6 Y7 – Y9 Y10 – Y11 Y12 – Y13 Maximum number of students 22 24 26 26 26 26 At the end of each academic year, it is the school’s policy to mix and reallocate all classes throughout the school. This process is undertaken to ensure the even spread of age, gender, nationality, and ability across the classes. What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm For detailed timings of all year groups,, please click here. What school transport is offered? What school transport is offered? A bus service is in operation at Sunmarke School. The details of this service, route and fees, are now available from the Transport Manager’s Office on the Ground Floor. For more information on bus fees, please click here. For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm Friday 12:15 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:30 pm onwards Friday 12.15 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:30 pm onwards Friday 12:15 pm onwards Further communication on this will be shared by our transportation department. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays Secondary Break 09:40am – 09:55am 9:40am – 9:55am Lunch 12:40pm – 01:40pm Not available Primary Key Stage 1 (Y1-2) Break 09:40am – 09:55pm 9:40am – 9:55am Lunch 10:50am – 11:45am Not available Primary Key Stage 2 (Y3- 6) Break 09:40am – 09:55am 9:40am – 9:55am Lunch 11:45am – 12:40pm Not available EYFS Break 09:40am – 09:55am Not available Lunch From 11:45am Not available 10. How do I pay for my child’s lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child’s lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child’s growth development. If your child doesn’t have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/school-calendar-events/list/?eventDisplay=past#kingster-mobile-menu",
    "title": "Past Events from May 4, 2023 – March 27, 2023 – Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 3,
    "content": "Past Events from May 4, 2023 – March 27, 2023 – Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Events 15 events found. School Events Calendar 2025-2026 July 2024 Fri 5 August 2024 Thu 15 October 2024 Wed 2 November 2024 Thu 7 Tue 12 Fri 15 Wed 27 Thu 28 December 2024 Wed 4 Thu 5 Fri 6 Thu 12 January 2025 Tue 14 Thu 23 Thu 30 Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file",
    "relevance_score": 0.352
  },
  {
    "url": "https://www.sunmarke.com/school-calendar-events/list/?eventDisplay=past#kingster-top-anchor",
    "title": "Past Events from May 4, 2023 – March 27, 2023 – Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 3,
    "content": "Past Events from May 4, 2023 – March 27, 2023 – Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Events 15 events found. School Events Calendar 2025-2026 July 2024 Fri 5 August 2024 Thu 15 October 2024 Wed 2 November 2024 Thu 7 Tue 12 Fri 15 Wed 27 Thu 28 December 2024 Wed 4 Thu 5 Fri 6 Thu 12 January 2025 Tue 14 Thu 23 Thu 30 Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file",
    "relevance_score": 0.352
  },
  {
    "url": "https://www.sunmarke.com/faqs/#kingster-mobile-menu",
    "title": "FAQs - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 3,
    "content": "FAQs - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login FAQs Admissions > FAQs Frequently Asked Questions (FAQ’s) All You Want To Know About The School And Its Facilities We have compiled a list of questions that parents are most likely to ask us in the early stages of the application process – we hope you find it useful. Should you have any other questions, please get in touch with our Family Happiness Team and we will be happy to help. How do I enrol my child? Enrolment for 2024-25 – New families 1) Can I come in for a school tour with my family? Yes, we would be delighted to welcome you and your family for a school tour. It’s a great opportunity to experience the atmosphere and gain insight into our school. 2) KHDA Parent School Contract Please note that: Students can only attend school if they are registered in the KHDA School System, and parents have signed the Parent-School Contract. The school will register the student once all the relevant documents have been uploaded by the parents. This contract needs to be digitally signed only once – by parents of students who are new to the school. The contract is usually sent via sms on their local mobile phones registered with the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents required to complete the registration process: Latest School Reports School reference letter, if a report is not available Attested Transfer Certificate 1 Passport Size Coloured Photo (Student and both Parents) Student Passport Copy Sponsoring Parents Passport Copy Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy 4) Age Cut-Off Dates New students must be enrolled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. How do I book Assessments? Admissions are open year-round, with prorated fees available. We are booking assessments for FS1, FS2, Year 1 to 10, and Year 12. For students currently overseas, we can offer online assessments. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. Can my child be assessed before arriving in Dubai? Online Assessment Procedure: The assessment will take place at home under exam conditions via MS Teams. For Year 6 and below, we recommend adult supervision throughout. Ensure your child has a quiet, distraction-free workspace and the necessary equipment: a computer with internet, video, and audio capabilities. All other electronic devices should be switched off. You will receive an email with the meeting link. Please check access ahead of time and join at the scheduled time. Assistance is only allowed for setting up the meeting and login. Any interference during the assessment will invalidate the results. Assessment Checklist: Quiet, well-ventilated workspace. Computer with internet, video, and audio. All distractions (TV, phones, etc.) turned off. Microsoft Teams ready to join the meeting. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students - FS1 to Year 13 - 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in maths, literacy, and SEMH (social and emotional mental health). We currently offer an alternative curriculum pathway for Key Stages 3 and 4. 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, delivered by specialist teachers and LSAs. There is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSP cost. This will then be a separate invoice. 5. How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am For detailed EYFS timings click here For detailed Primary timings click here For detailed Secondary & Sixth Form timings click here What school transport is offered? What school transport is offered? Sunmarke uses an independent third party bus operator “My Bus Transport Services LLC” to make the school run as easy as possible. “My Bus” operates an air-conditioned and efficient transport service from various parts of Dubai to the school. Parents may avail of this service at their own discretion and cost. My Bus Transport Services manages the school transport operations. The details of services, route and fees, are now available from the Transport office. You can also find the details online, please click here . For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm onwards Friday 12:10 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:40 pm onwards Friday 12.10 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:40 pm onwards Friday 12:10 pm onwards Further communication related to pick-up and drop-off schedules will be shared by the transportation department upon successful registration and payment. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays EYFS Break 09:40 am – 09:55 am Not available Lunch Not available Not available Primary Key Stage 1 (Y1 - Y2) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 10:50 am – 11:45 am Not available Primary Key Stage 2 (Y3 - Y6) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 11:45 am – 12:40 pm Not available Secondary (Y7 - Y9 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 1:10 pm – 01:40 pm (Monday to Tuesday) 12:40 pm – 01:40 pm (Wednesday to Thursday) Not available Secondary (Y10 - Y13 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 12:40 pm – 01:40 pm (Monday to Tuesday) 01:10 pm – 01:40 pm (Wednesday to Thursday) Not available 10. How do I pay for my child's lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child's lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child's growth development. If your child doesn't have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies. How do I enrol my child? Enrolment for 2025-26 – New families 1) Can I come in for a school tour with my family? We are now able to conduct school tours for prospective students and their parents. 2) KHDA Parent School Contract To prepare for enrolment into the new academic year 2025-26, please note that: Students can only attend school in the new academic year if they are registered in the KHDA School System and parents have signed the Parent-School Contract. Please download the Dubai Now App which will enable you to sign the Parent/School Contract online. This only needs to be signed by parents of students who are new to the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school for 2025-26, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents that should be submitted to the school are: Letter of current enrolment at school (Year 2 Up) Transfer Certificate (Attested by UAE Embassy) School reference letter (Year 2 Up) School Reports – 2024-25 (Year 2 Up) 1 Passport Size Coloured Photo ( Student and both Parents) Student Passport Copy Student UAE Visa Copy Sponsoring Parents Passport and UAE Visa Copy Birth Certificate (in English or Arabic) Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy DHA Medical & Immunisation Consent form 4) Age Cut-Off Dates New students must be enroled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. What are the age requirements for AY 2024-25? 1. What are the changes to the age requirements for entry to Sunmarke School? Age requirements will change for new students enroled into FS1, according to the UAE Ministry of Education Resolution no (24). Children enroling into FS1, starting in September, must be three years old on or before the 31st of August. Children enroling into FS2, starting in September, must be four years old on or before the 31st of August. Similarly, children enroling into Year 1, starting school in September, must be five years old on or before the 31st of August. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. This includes students who enrol for the final term of the 2023/24 academic year. Schools that start the academic year in September, in line with MOE Resolution no (24). Year Group Age requirement Foundation Stage 1 3 years old by August 31st Foundation Stage 2 4 years old by August 31st Year 1 5 years old by August 31 Year 2 6 years old by August 31 2. When did this change come into effect? This change was applicable from the start of the 2021/22 academic year in September 2021. 3. Why was this change made? This decision was made to bring more consistency to the cut-off dates used by schools in the UAE with those used by schools abroad. For example, UK schools in the UAE will now have the same cut-off date as schools in the UK, and international British schools. 4.Who will this change impact? This change will impact children up to six years old who are enrolling in school for the first time. 5. Will the new cut-off date apply to all year groups? It will apply to new students enrolling in FS1, FS2, Year 1 and Year 2 in all schools in the UAE, as stipulated in the MOE resolution. 6. My child was born in October and is now in FS1 – I want to enrol him in another school for FS2. Can I do this or does he have to repeat a year? Because your child is already enroled in school, the new cut-off dates in the MOE resolution do not apply. He does not have to repeat the year. 7. My son was enroled in FS1 this year but I withdrew his enrolment due to COVID-19. He’ll be 3 years old in September. Can I still enrol him in FS2 next year? Your child must have formally finished the previous academic year in order to enrol in the next one. Since he does not meet the age requirement for FS2 for next academic year, he must enrol in FS1. According to the MOE resolution, he can enrol in FS2 next academic year only if he completes FS1 this academic year. 8. My daughter will be 4 years old in December. If I enrol her in FS2 for the last term of this year – before the changes come into effect – will she be able to start Year 1 next year? Yes. The new age requirements will apply for new students from the start of the next academic year only. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. 9. I’ve already registered and paid the deposit for my daughter to start school in FS2 in September. She will be four years old in November. Is she affected by this? According to the new cut-off dates in the MOE resolution, your daughter will not be able to start in FS2 in September. Alternatively, we would be happy to transfer your child’s application to their age-appropriate year group (FS1) and register your child for this year group instead. Parents whose children are affected by the new cut-off dates and who have already paid deposits for their children’s enrolment are entitled to a refund if they wish. 10. My child was born one day after the cut-off date. Is there some leeway given? No exceptions to the cut-off dates will be given under any circumstances How do I book Assessments for entry 2025-26 AY? Admissions are now open for applications for 2025-26 AY* entry. The 2025-2026 Assessment Diary is Open – We are now booking assessments for year groups FS1 & FS2, Year 1 to 10 and Year 12. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. For students currently overseas: For students in current Year 6 and above we can offer Assessment at the current school attended. Please contact us to find out more. Students transferring from UK schools in all years, please contact us directly for more details. Can my child be assessed before arriving into Dubai? For Students entering Year 7 and above, assessment can be offered at the current school attended if that school is willing to administer the test under examination conditions. The assessment will be the same as that taken by our local students with the addition of a Skype interview. You will need to provide registration, a letter of enrolment, the latest school report, and a recommendation form by the date of assessment. For students transferring from UK schools please contact admissions directly to discuss your application. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students – FS1 to Year 13 – 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in language, maths, literacy, and functional independence. We are currently working to develop our range of alternative curriculum pathways for Key Stages 2, 3, and 4 so that, in time, we can offer an appropriate pathway for every learner. What is Year 7 and Year 8 Life skills Pathway? 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, supplemented by ASDAN modules. As it is a supplemented curriculum which focuses on reduced teachers, as per KHDA, there is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSA cost. This will then be a separate invoice. 5 How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. For more information on the pathway, please click here What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? Students transferring to Sunmarke School from Regent International School, will not be required to pay additional Assessment or Registration fees. Transferring students are only required to complete the RIS Re-Enrollment Form and pay the 5 % re-enrolment fee by the start of the third term each year to secure their seat. What are the tuition fees and discounts for Regent International School transfers to Sunmarke school for FS1-Year 13 (2025-26)? Fee Structure – Transferring students from Regent International School to Sunmarke School Application Fee Dhs.525/- – Not chargeable Re-enrollment Fee (Existing Students) 5% of Tuition Fee – Non-refundable, adjusted against the 1st Term’s Tuition Fee, 1st day of Term3 Transferring RIS Students Phase Tuition Fees Year Group Discounted Tuition Fees for students transferring from Year 6 at Regent Foundation 1 46,700 Foundation 2 51,900 Year 1 58,548 Year 2 58,548 Year 3 59,619 Year 4 59,619 Year 5 59,619 Year 6 59,619 Year 7 67,290 Year 8 67,290 Year 9 67,290 Year 10 69,397 Year 11 69,397 Year 12 70,276 Year 13 70,276 Additional Benefits: Sibling Discounts: 1st Sibling 5%, 2nd Sibling 10%, 3rd Sibling 10%, 4th Sibling 10%. The sibling discount scheme is available to those siblings from the same family who enrol at the school for one full academic year. The sibling discount is applicable to the 2nd, 3rd, 4th and 5th child from the same family. The amount of the discount is calculated off the actual Tuition Fee paid of the child who pays the lowest tuition fee amongst the siblings enrolled at the school. The maximum discount per family cannot exceed 35% of the lowest paying sibling’s Tuition Fee. SCHOOL ACCOUNT DETAILS TUITION FEES – DUE DATES Payment can be made via wire transfer to the following account: Re-enrolment 15 th December Account Name : SUNMARKE SCHOOL LLC Autumn Term 01 st August Account Number : 12000921414 Spring Term 15 th November Bank Name : National Bank of Fujairah PJSC Summer Term 15 th February Branch : Jebel Ali Swift : NBFUAEAFDXB IBAN # : AE220380000012000921414 Remarks : Please email proof of all payments to: accounts.sms@sunmarkedubai.com , and cc: officemanager.sms@forteseducation.com & registrar.sms@forteseducation.com Additional Fees (charged separately from Tuition Fee): Optional Transportation Services via 3rd Party Service Provider; Optional Dining Services via 3rd Party Service Provider; Optional After-School Activities provided by 3 rd Party Service Providers; School Uniforms; Educational Visits; School Fees are subject to change in accordance with the Knowledge and Human Development Authority (KHDA) Fees Framework What are the sibling discounts if siblings are at both Sunmarke School and Regent International School for 2025-26? In cases where the eldest sibling transfers to the secondary phase at Sunmarke School, but the FS and Primary Phase siblings stay at Regent International School the following discount policy will be applied on full-year attendance: Example 1: Eldest Child (1st Child in the family) – Attending Sunmarke: No Discount 2nd Child from the same family (Sibling 1 at SMS): 5% deducted from 3rd Term Tuition fee as per SMS Policy 3rd Child from the same family (Sibling 2 at SMS): 10% deducted from 3rd Term Tuition fee as per SMS Policy 4th Child from the same family (Sibling 3 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy 5th Child from the same family (Sibling 4 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy Example 2: Eldest Child (1st Child in the family) – Attending Sunmarke School: No Discount 2nd Child from the same family (Sibling 1 at RIS): 5% deducted from 3rd Term Tuition fee as per RIS Policy 3rd Child from the same family (Sibling 2 at RIS): 10% deducted from 3rd Term Tuition fee as per RIS Policy 4th Child from the same family (Sibling 3 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy 5th Child from the same family (Sibling 4 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy *Please note, that these discounts will be applied to the 1st, 2nd, 3rd or 4th siblings 3rd Term of joining actual Tuition Fee. The maximum discount per family is equal to 35% of the lowest sibling’s tuition fee. What is the Sunmarke School and Regent International School returning students -Founders Fee entitlement? If a Regent International School or Sunmarke School student leaves the school but returns to the School before the end of one (1) academic term, they will keep their entitlement to the Regent International School Transfers to Sunmarke School Tuition Fee Structure. If more than one Term passes, then the student will be considered a New Student and will be required to pay the New Students Fee Structure as applicable to their group of re-entry. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What is the class capacity? Class Sizes for Academic Year 2025-26: To ensure each student receives the individualised care he/she deserves, we cap classes based on the year. Below is a breakdown of student-to-teacher ratios by year: Year Group FS1 FS2 – Y1 Y2 – Y6 Y7 – Y9 Y10 – Y11 Y12 – Y13 Maximum number of students 22 24 26 26 26 26 At the end of each academic year, it is the school’s policy to mix and reallocate all classes throughout the school. This process is undertaken to ensure the even spread of age, gender, nationality, and ability across the classes. What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm For detailed timings of all year groups,, please click here. What school transport is offered? What school transport is offered? A bus service is in operation at Sunmarke School. The details of this service, route and fees, are now available from the Transport Manager’s Office on the Ground Floor. For more information on bus fees, please click here. For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm Friday 12:15 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:30 pm onwards Friday 12.15 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:30 pm onwards Friday 12:15 pm onwards Further communication on this will be shared by our transportation department. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays Secondary Break 09:40am – 09:55am 9:40am – 9:55am Lunch 12:40pm – 01:40pm Not available Primary Key Stage 1 (Y1-2) Break 09:40am – 09:55pm 9:40am – 9:55am Lunch 10:50am – 11:45am Not available Primary Key Stage 2 (Y3- 6) Break 09:40am – 09:55am 9:40am – 9:55am Lunch 11:45am – 12:40pm Not available EYFS Break 09:40am – 09:55am Not available Lunch From 11:45am Not available 10. How do I pay for my child’s lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child’s lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child’s growth development. If your child doesn’t have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/faqs/#kingster-top-anchor",
    "title": "FAQs - Sunmarke School | British Curriculum | International School in Dubai",
    "depth": 3,
    "content": "FAQs - Sunmarke School | British Curriculum | International School in Dubai Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login FAQs Admissions > FAQs Frequently Asked Questions (FAQ’s) All You Want To Know About The School And Its Facilities We have compiled a list of questions that parents are most likely to ask us in the early stages of the application process – we hope you find it useful. Should you have any other questions, please get in touch with our Family Happiness Team and we will be happy to help. How do I enrol my child? Enrolment for 2024-25 – New families 1) Can I come in for a school tour with my family? Yes, we would be delighted to welcome you and your family for a school tour. It’s a great opportunity to experience the atmosphere and gain insight into our school. 2) KHDA Parent School Contract Please note that: Students can only attend school if they are registered in the KHDA School System, and parents have signed the Parent-School Contract. The school will register the student once all the relevant documents have been uploaded by the parents. This contract needs to be digitally signed only once – by parents of students who are new to the school. The contract is usually sent via sms on their local mobile phones registered with the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents required to complete the registration process: Latest School Reports School reference letter, if a report is not available Attested Transfer Certificate 1 Passport Size Coloured Photo (Student and both Parents) Student Passport Copy Sponsoring Parents Passport Copy Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy 4) Age Cut-Off Dates New students must be enrolled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. How do I book Assessments? Admissions are open year-round, with prorated fees available. We are booking assessments for FS1, FS2, Year 1 to 10, and Year 12. For students currently overseas, we can offer online assessments. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. Can my child be assessed before arriving in Dubai? Online Assessment Procedure: The assessment will take place at home under exam conditions via MS Teams. For Year 6 and below, we recommend adult supervision throughout. Ensure your child has a quiet, distraction-free workspace and the necessary equipment: a computer with internet, video, and audio capabilities. All other electronic devices should be switched off. You will receive an email with the meeting link. Please check access ahead of time and join at the scheduled time. Assistance is only allowed for setting up the meeting and login. Any interference during the assessment will invalidate the results. Assessment Checklist: Quiet, well-ventilated workspace. Computer with internet, video, and audio. All distractions (TV, phones, etc.) turned off. Microsoft Teams ready to join the meeting. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students - FS1 to Year 13 - 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in maths, literacy, and SEMH (social and emotional mental health). We currently offer an alternative curriculum pathway for Key Stages 3 and 4. 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, delivered by specialist teachers and LSAs. There is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSP cost. This will then be a separate invoice. 5. How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:15 pm Friday 7:40 am – 11:30 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:30 pm Friday 7:40 am – 11:45 am For detailed EYFS timings click here For detailed Primary timings click here For detailed Secondary & Sixth Form timings click here What school transport is offered? What school transport is offered? Sunmarke uses an independent third party bus operator “My Bus Transport Services LLC” to make the school run as easy as possible. “My Bus” operates an air-conditioned and efficient transport service from various parts of Dubai to the school. Parents may avail of this service at their own discretion and cost. My Bus Transport Services manages the school transport operations. The details of services, route and fees, are now available from the Transport office. You can also find the details online, please click here . For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm onwards Friday 12:10 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:40 pm onwards Friday 12.10 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:40 pm onwards Friday 12:10 pm onwards Further communication related to pick-up and drop-off schedules will be shared by the transportation department upon successful registration and payment. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays EYFS Break 09:40 am – 09:55 am Not available Lunch Not available Not available Primary Key Stage 1 (Y1 - Y2) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 10:50 am – 11:45 am Not available Primary Key Stage 2 (Y3 - Y6) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 11:45 am – 12:40 pm Not available Secondary (Y7 - Y9 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 1:10 pm – 01:40 pm (Monday to Tuesday) 12:40 pm – 01:40 pm (Wednesday to Thursday) Not available Secondary (Y10 - Y13 ) Break 09:40 am – 09:55 am 9:40am – 9:55am Lunch 12:40 pm – 01:40 pm (Monday to Tuesday) 01:10 pm – 01:40 pm (Wednesday to Thursday) Not available 10. How do I pay for my child's lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child's lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child's growth development. If your child doesn't have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies. How do I enrol my child? Enrolment for 2025-26 – New families 1) Can I come in for a school tour with my family? We are now able to conduct school tours for prospective students and their parents. 2) KHDA Parent School Contract To prepare for enrolment into the new academic year 2025-26, please note that: Students can only attend school in the new academic year if they are registered in the KHDA School System and parents have signed the Parent-School Contract. Please download the Dubai Now App which will enable you to sign the Parent/School Contract online. This only needs to be signed by parents of students who are new to the school. 3) Documents for Registering at Sunmarke School If you are a new family, joining the school for 2025-26, please ensure that all pending documentation for your child is submitted to the Admissions department at Sunmarke School. Documents that should be submitted to the school are: Letter of current enrolment at school (Year 2 Up) Transfer Certificate (Attested by UAE Embassy) School reference letter (Year 2 Up) School Reports – 2024-25 (Year 2 Up) 1 Passport Size Coloured Photo ( Student and both Parents) Student Passport Copy Student UAE Visa Copy Sponsoring Parents Passport and UAE Visa Copy Birth Certificate (in English or Arabic) Student’s Emirates ID Card (back & Front) Sponsoring Parent Emirates ID card (back & Front) Vaccination & Immunisation Record Copy DHA Medical & Immunisation Consent form 4) Age Cut-Off Dates New students must be enroled in their respective age groups as per the ministerial decree (820) of 2014. The cut-off date is 31 st August without exception. The table below shows the age/year-group information of students aged 3 to 6. Sunmarke School is required to comply with the age/year-group criteria and the cut-off date as per the ministerial decree. Year FS1 FS2 Year 1 Year 2 Age by 31 st August 3 4 5 6 This is a federal law and we are not able to consider any exemption requests. What are the KHDA guidelines for Admissions and Transfers? Click here to read Guidelines for Admissions and Transfers by KHDA. What are the age requirements for AY 2024-25? 1. What are the changes to the age requirements for entry to Sunmarke School? Age requirements will change for new students enroled into FS1, according to the UAE Ministry of Education Resolution no (24). Children enroling into FS1, starting in September, must be three years old on or before the 31st of August. Children enroling into FS2, starting in September, must be four years old on or before the 31st of August. Similarly, children enroling into Year 1, starting school in September, must be five years old on or before the 31st of August. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. This includes students who enrol for the final term of the 2023/24 academic year. Schools that start the academic year in September, in line with MOE Resolution no (24). Year Group Age requirement Foundation Stage 1 3 years old by August 31st Foundation Stage 2 4 years old by August 31st Year 1 5 years old by August 31 Year 2 6 years old by August 31 2. When did this change come into effect? This change was applicable from the start of the 2021/22 academic year in September 2021. 3. Why was this change made? This decision was made to bring more consistency to the cut-off dates used by schools in the UAE with those used by schools abroad. For example, UK schools in the UAE will now have the same cut-off date as schools in the UK, and international British schools. 4.Who will this change impact? This change will impact children up to six years old who are enrolling in school for the first time. 5. Will the new cut-off date apply to all year groups? It will apply to new students enrolling in FS1, FS2, Year 1 and Year 2 in all schools in the UAE, as stipulated in the MOE resolution. 6. My child was born in October and is now in FS1 – I want to enrol him in another school for FS2. Can I do this or does he have to repeat a year? Because your child is already enroled in school, the new cut-off dates in the MOE resolution do not apply. He does not have to repeat the year. 7. My son was enroled in FS1 this year but I withdrew his enrolment due to COVID-19. He’ll be 3 years old in September. Can I still enrol him in FS2 next year? Your child must have formally finished the previous academic year in order to enrol in the next one. Since he does not meet the age requirement for FS2 for next academic year, he must enrol in FS1. According to the MOE resolution, he can enrol in FS2 next academic year only if he completes FS1 this academic year. 8. My daughter will be 4 years old in December. If I enrol her in FS2 for the last term of this year – before the changes come into effect – will she be able to start Year 1 next year? Yes. The new age requirements will apply for new students from the start of the next academic year only. The MOE resolution stipulates that all students currently enroled at private schools in the UAE are not affected by the change. 9. I’ve already registered and paid the deposit for my daughter to start school in FS2 in September. She will be four years old in November. Is she affected by this? According to the new cut-off dates in the MOE resolution, your daughter will not be able to start in FS2 in September. Alternatively, we would be happy to transfer your child’s application to their age-appropriate year group (FS1) and register your child for this year group instead. Parents whose children are affected by the new cut-off dates and who have already paid deposits for their children’s enrolment are entitled to a refund if they wish. 10. My child was born one day after the cut-off date. Is there some leeway given? No exceptions to the cut-off dates will be given under any circumstances How do I book Assessments for entry 2025-26 AY? Admissions are now open for applications for 2025-26 AY* entry. The 2025-2026 Assessment Diary is Open – We are now booking assessments for year groups FS1 & FS2, Year 1 to 10 and Year 12. Please contact the Sunmarke Admissions Office to confirm your child’s assessment date. For students currently overseas: For students in current Year 6 and above we can offer Assessment at the current school attended. Please contact us to find out more. Students transferring from UK schools in all years, please contact us directly for more details. Can my child be assessed before arriving into Dubai? For Students entering Year 7 and above, assessment can be offered at the current school attended if that school is willing to administer the test under examination conditions. The assessment will be the same as that taken by our local students with the addition of a Skype interview. You will need to provide registration, a letter of enrolment, the latest school report, and a recommendation form by the date of assessment. For students transferring from UK schools please contact admissions directly to discuss your application. What are the tuition fees for FS1- Year 13 (2025-26)? Tuition Fees Click here to view the Tuition Fees: New Students – FS1 to Year 13 – 2025-26 What are the KHDA document fees? Tariff for the following KHDA services as stipulated by KHDA: Request for student Education Continuation Certificate for visa renewal (AED 120) Request for student leaving form for the students who are leaving Dubai (AED 120) Request for student transfer between private schools (within the stipulated time frame)-Student transfer (AED 120) Can my child with special education needs attend Sunmarke school? At Sunmarke, we exercise a positive and inclusive admissions policy. Candidates will each be given due consideration on a case-by-case basis, and we will take into account the capacity of the premises, staff and curriculum pathways to effectively meet the needs of the individual. Our Achievement Centre offers a broad range of additional support for students with SEND, including targeted support in language, maths, literacy, and functional independence. We are currently working to develop our range of alternative curriculum pathways for Key Stages 2, 3, and 4 so that, in time, we can offer an appropriate pathway for every learner. What is Year 7 and Year 8 Life skills Pathway? 1. Is it approved by the Ministry of Education? It is a mainstream curriculum, supplemented by ASDAN modules. As it is a supplemented curriculum which focuses on reduced teachers, as per KHDA, there is no need for permission for this pathway as it falls under our current education licence. 2. What are the timings if my son is enroled in this program? The timings are that of the normal school day, unless the student has additional needs or commitments outside of school that need to be met. As a KHDA accredited Rahhal provider, we can review timings to meet the student’s needs. 3. What is the cost for LSA? Costs are an estimate range until all students are enroled. 4. What would be mentioned in the invoice for this program? Is it “Tuition fee”? School fees are billed as normal. Parents will then have to sign a KHDA Individual Service Agreement for the LSA cost. This will then be a separate invoice. 5 How will I enrol my child? Our SENCO will assess the student before we can accept to ensure we can meet their needs in this class. It is a pathway that supports access to the mainstream and we can’t cater for severe needs. For more information on the pathway, please click here What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? What is the Assessment, Registration, and Re-enrolment fees for Regent International School students transferring to Sunmarke School? Students transferring to Sunmarke School from Regent International School, will not be required to pay additional Assessment or Registration fees. Transferring students are only required to complete the RIS Re-Enrollment Form and pay the 5 % re-enrolment fee by the start of the third term each year to secure their seat. What are the tuition fees and discounts for Regent International School transfers to Sunmarke school for FS1-Year 13 (2025-26)? Fee Structure – Transferring students from Regent International School to Sunmarke School Application Fee Dhs.525/- – Not chargeable Re-enrollment Fee (Existing Students) 5% of Tuition Fee – Non-refundable, adjusted against the 1st Term’s Tuition Fee, 1st day of Term3 Transferring RIS Students Phase Tuition Fees Year Group Discounted Tuition Fees for students transferring from Year 6 at Regent Foundation 1 46,700 Foundation 2 51,900 Year 1 58,548 Year 2 58,548 Year 3 59,619 Year 4 59,619 Year 5 59,619 Year 6 59,619 Year 7 67,290 Year 8 67,290 Year 9 67,290 Year 10 69,397 Year 11 69,397 Year 12 70,276 Year 13 70,276 Additional Benefits: Sibling Discounts: 1st Sibling 5%, 2nd Sibling 10%, 3rd Sibling 10%, 4th Sibling 10%. The sibling discount scheme is available to those siblings from the same family who enrol at the school for one full academic year. The sibling discount is applicable to the 2nd, 3rd, 4th and 5th child from the same family. The amount of the discount is calculated off the actual Tuition Fee paid of the child who pays the lowest tuition fee amongst the siblings enrolled at the school. The maximum discount per family cannot exceed 35% of the lowest paying sibling’s Tuition Fee. SCHOOL ACCOUNT DETAILS TUITION FEES – DUE DATES Payment can be made via wire transfer to the following account: Re-enrolment 15 th December Account Name : SUNMARKE SCHOOL LLC Autumn Term 01 st August Account Number : 12000921414 Spring Term 15 th November Bank Name : National Bank of Fujairah PJSC Summer Term 15 th February Branch : Jebel Ali Swift : NBFUAEAFDXB IBAN # : AE220380000012000921414 Remarks : Please email proof of all payments to: accounts.sms@sunmarkedubai.com , and cc: officemanager.sms@forteseducation.com & registrar.sms@forteseducation.com Additional Fees (charged separately from Tuition Fee): Optional Transportation Services via 3rd Party Service Provider; Optional Dining Services via 3rd Party Service Provider; Optional After-School Activities provided by 3 rd Party Service Providers; School Uniforms; Educational Visits; School Fees are subject to change in accordance with the Knowledge and Human Development Authority (KHDA) Fees Framework What are the sibling discounts if siblings are at both Sunmarke School and Regent International School for 2025-26? In cases where the eldest sibling transfers to the secondary phase at Sunmarke School, but the FS and Primary Phase siblings stay at Regent International School the following discount policy will be applied on full-year attendance: Example 1: Eldest Child (1st Child in the family) – Attending Sunmarke: No Discount 2nd Child from the same family (Sibling 1 at SMS): 5% deducted from 3rd Term Tuition fee as per SMS Policy 3rd Child from the same family (Sibling 2 at SMS): 10% deducted from 3rd Term Tuition fee as per SMS Policy 4th Child from the same family (Sibling 3 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy 5th Child from the same family (Sibling 4 at SMS): 10% deducted from 3rd Term Tuition Fee as per SMS Policy Example 2: Eldest Child (1st Child in the family) – Attending Sunmarke School: No Discount 2nd Child from the same family (Sibling 1 at RIS): 5% deducted from 3rd Term Tuition fee as per RIS Policy 3rd Child from the same family (Sibling 2 at RIS): 10% deducted from 3rd Term Tuition fee as per RIS Policy 4th Child from the same family (Sibling 3 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy 5th Child from the same family (Sibling 4 at RIS): 10% deducted from 3rd Term Tuition Fee as per RIS Policy *Please note, that these discounts will be applied to the 1st, 2nd, 3rd or 4th siblings 3rd Term of joining actual Tuition Fee. The maximum discount per family is equal to 35% of the lowest sibling’s tuition fee. What is the Sunmarke School and Regent International School returning students -Founders Fee entitlement? If a Regent International School or Sunmarke School student leaves the school but returns to the School before the end of one (1) academic term, they will keep their entitlement to the Regent International School Transfers to Sunmarke School Tuition Fee Structure. If more than one Term passes, then the student will be considered a New Student and will be required to pay the New Students Fee Structure as applicable to their group of re-entry. What are the facilities you offer? What are the facilities you offer? We have state-of-the-art facilities on offer with special attention paid to athletics, the arts and the latest technological advancements. Below is an indication of the amenities provided to our students. Facilities Athletics Creative and Performing Arts Academic FIFA - 18 Sized Football Pitch 200 Meter Athletics Running Track Two Swimming Pools Tennis, Basketball, Volleyball and Netball Courts Two Expansive Multipurpose Halls Three Fine Arts Labs Dedicated Drama Studio 600 Seat Auditorium Four Music Labs TV & Radio Production Studios Nine World-Class Science Labs Five Design Technology Labs Three Libraries with Media Centres What is the class capacity? Class Sizes for Academic Year 2025-26: To ensure each student receives the individualised care he/she deserves, we cap classes based on the year. Below is a breakdown of student-to-teacher ratios by year: Year Group FS1 FS2 – Y1 Y2 – Y6 Y7 – Y9 Y10 – Y11 Y12 – Y13 Maximum number of students 22 24 26 26 26 26 At the end of each academic year, it is the school’s policy to mix and reallocate all classes throughout the school. This process is undertaken to ensure the even spread of age, gender, nationality, and ability across the classes. What nationalities make up the school body? Sunmarke is a truly international school with a focus on fostering diversity and nurturing talent. Sunmarke continues in Regent International ‘s tradition with regards to enrolment with 90+ nationalities represented with the largest percentage hailing from the U.K. What are the school timings? Year Group Timings Foundation Stage 1 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Foundation Stage 2 Monday to Thursday 7:40 am – 1:30 pm Friday 7:40 am – 11:45 am Primary (Year 1 to 6) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm Secondary (Year 7 to 13) Monday to Thursday 7:40 am – 3:10 pm Friday 7:40 am – 11:45 pm For detailed timings of all year groups,, please click here. What school transport is offered? What school transport is offered? A bus service is in operation at Sunmarke School. The details of this service, route and fees, are now available from the Transport Manager’s Office on the Ground Floor. For more information on bus fees, please click here. For more information on our routes and the health & safety protocols for our buses, please click here . What is the pickup/drop off timings? School Transport Timings Bus start times remain the same. For drop-off, buses will leave from the school at the following times Year Group Timings EYFS Monday to Thursday 1:30 pm Friday 12:15 pm onwards Primary (Year 1 to 6) Monday to Thursday 3:30 pm onwards Friday 12.15 pm onwards Secondary (Year 7 to 13) Monday to Thursday 3:30 pm onwards Friday 12:15 pm onwards Further communication on this will be shared by our transportation department. How do I order food for my child? 1. How do I book the service? Booking can only be done for EYFS and Primary students. Secondary students can go directly to the canteen to select their food and make payment. EYFS and Primary parents need to pre-book their order in advance via the link provided http://form.jotform.com/Mastercook/Sunmarke-stripe and lunch will be delivered in their class. 2. What is the price for lunch? Lunch is priced at AED24.25 this includes the main lunch and a dessert. 3. What is the menu like? Please click TERM MENU to see current available menu. Alternatively, secondary students can check out our GRAB AND GO menu. 4. Do you offer special meal plans? As a nut-free school, all meals are prepared using nut-free products. We also offer bespoke menus for students with special dietary needs, including gluten-free, dairy-free, etc. For this request, please contact coordinator@mastercook.ae for a specialised price and to discuss options. 5. Does your menu contain allergen information? As per Dubai Municipality guidelines, we follow their standard of menu labels that include the ingredients, allergens, and calorie content. The menu also has a specialised coding that identifies the contents of the meal, allowing our students to check if it contains something they are allergic to. Please communicate this to your child if they are in Secondary school. With Lactose With Egg With gluten Seafood With Soy Vegetarian 6. Can my child buy food at the Grab & Go counter? This option caters only to our Secondary school students and staff. The Grab & Go section of the dining services is exactly what it is – you grab the food, make the payment, and go on with your daily activity. We always ensure that there is a menu suitable for vegetarians and non-vegetarians. 7. What are the canteen timings? The canteen is open from 7am to 3.30 pm Monday to Thursday and 7am to 12:00 noon on Friday. Please note that only the Grab and Go section of the canteen is open on Friday. 8. Is breakfast available in the canteen? A healthy breakfast, via the Grab and Go section, is available daily from 7am. Secondary school students can only use the canteen at break time and lunchtime. 9. What time are the dining services available and when is lunch delivered to EYFS and Primary students? The lunch period for various year groups is listed as per the below timetable. For EYFS and Primary students, lunch will be delivered to their classroom prior to their scheduled lunch break. All the delivered lunches will have the names clearly labelled on them so that teachers can easily identify and distribute them to the children during lunchtime. Phases Mondays to Thursdays Fridays Secondary Break 09:40am – 09:55am 9:40am – 9:55am Lunch 12:40pm – 01:40pm Not available Primary Key Stage 1 (Y1-2) Break 09:40am – 09:55pm 9:40am – 9:55am Lunch 10:50am – 11:45am Not available Primary Key Stage 2 (Y3- 6) Break 09:40am – 09:55am 9:40am – 9:55am Lunch 11:45am – 12:40pm Not available EYFS Break 09:40am – 09:55am Not available Lunch From 11:45am Not available 10. How do I pay for my child’s lunch? For EYFS and Primary students, parents can pay upon confirming their order. For secondary, payments can be made using their credit card/apple pay / google pay/cash. 11. What if I forgot to place order can you still give my child her/his food? We understand that parents can get busy and at times forget to make lunch, for this one time emergency situation, we suggest you contact Mastercook – Person in Charge- Ms Karen directly on +971566180756 and she will be happy to assist you for the day. 12. Who do I contact for any queries, suggestions, and clarifications? The Mastercook catering team is happy to assist parents with their queries and for clarification. Please reach out to Karen from Mastercook on +971 52 618 0756 (mobile number) +971 4 448 8103 (Mastercook Office #) +971 4 423 8995 (school number) or email enquiries to coordinator@mastercook.ae 13. I am travelling for 3 days and would like to book my child lunch during the time I am away, can I place order for 3 days only? We are pleased to inform you that Mastercook are now accepting orders for short period, please go to the booking form and indicate the days you will require your child’s lunch delivered. 14. My child forgot to bring money, can you give him food? Mastercook believe that food is essential part of child’s growth development. If your child doesn’t have money for the day, we will issue them the food for you to pay later. Our canteen supervisor will contact parents to confirm this and check for any allergies.",
    "relevance_score": 0.357
  },
  {
    "url": "https://www.sunmarke.com/blog/education/38398/why-the-early-years-matter-most-setting-strong-foundations-in-eyfs/",
    "title": "How to Choose the Right School and Curriculum: A Complete Guide",
    "depth": 3,
    "content": "How to Choose the Right School and Curriculum: A Complete Guide Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Sunmarke Blog > Education > Why the Early Years Matter Most: Setting Strong Foundations in EYFS In a world where educational milestones are often measured by test scores and university placements, it can be easy to overlook the immense value of the early years. Yet research continues to affirm what many educators have always known: a child’s earliest learning experiences form the foundation for everything that follows . That’s why the Early Years Foundation Stage (EYFS) isn’t just a starting point—it’s the launchpad for lifelong learning, wellbeing and personal growth. At forward-thinking schools like Sunmarke, the EYFS isn’t simply about preparing children for Year 1—it’s about nurturing curiosity, developing essential life skills, and building confident, independent young learners through a blend of play, discovery, and guided learning. A Curriculum That Respects How Young Children Learn The EYFS framework in the UK, followed by leading international schools in Dubai and beyond, is grounded in the understanding that children learn best when they feel safe, engaged, and valued . The curriculum focuses on seven key areas of development, from communication and language to physical development and understanding the world. In practice, this means an environment rich in storytelling, role play, sensory exploration, and problem-solving activities . At Sunmarke, for instance, you’ll find children immersed in everything from phonics and number songs to planting seeds, experimenting with textures, or acting out imaginative stories—all under the guidance of caring educators who observe, extend and scaffold learning in real time. Learning Through Play – With Purpose In the EYFS, play isn’t a break from learning, it i s the learning. Children develop critical thinking, collaboration, and emotional regulation through imaginative and structured play. Whether building with blocks, negotiating roles in a game, or investigating bugs in the outdoor classroom, every moment of play is carefully designed to support a child’s progress and interests. At Sunmarke, the integration of play with purpose is elevated through access to modern facilities, highly trained staff, and an innovative curriculum that promotes inquiry and creativity. Children are encouraged to ask questions, explore solutions, and follow their own learning pathways. A Holistic Approach to Growth The early years are about far more than academic readiness. It’s during this time that children begin to develop the social, emotional and physical skills that will shape how they approach school and life. With a strong focus on emotional wellbeing and character building, Sunmarke’s EYFS framework ensures that children feel secure, supported and capable . Through positive relationships and well-planned routines, children learn to manage emotions, build friendships, and grow in independence. The school’s commitment to character education and positive education (PosEd) is embedded from the very start, helping even the youngest learners to build resilience, empathy, and a love for learning. A Strong Start Leads to a Strong Future Numerous studies have shown that high-quality early years education leads to better academic performance, stronger social skills, and higher levels of self-esteem later in life. When children feel confident, capable and curious from a young age, they are far more likely to flourish as they move through school and beyond. Schools like Sunmarke understand this. Their EYFS provision is not only aligned with the highest standards but also enriched by specialist programmes, outdoor learning experiences, and an inclusive, nurturing ethos that celebrates every child’s unique journey. The early years matter, not just for school readiness, but for setting the emotional, social and cognitive foundation for life. In an ever-changing world, children need more than academic skills. They need creativity, confidence, resilience and curiosity and the best EYFS settings are where those qualities take root. If you’re a parent exploring early years education, look for a setting where your child is seen, heard, and inspired every day. Because those early footsteps are the ones that shape a lifelong path. 0 Shares Prev Next Recent Blogs 28/11/2025 Career Readiness: Why It Matters for Students Today 21/11/2025 Expressive Art and Creativity in EYFS: Encouraging Self-Expression 14/11/2025 How Schools Can Lead the Way in Sustainable Practices 07/11/2025 The Rise of AI in Media: Opportunities for Young Creators 28/10/2025 Fortes Pro Sports Academy at Sunmarke: Nurturing the Next Generation of Student Athletes",
    "relevance_score": 0.429
  },
  {
    "url": "https://www.sunmarke.com/blog/education/38394/what-is-ib-diploma-programme-how-does-it-prepare-students-for-university/",
    "title": "How to Choose the Right School and Curriculum: A Complete Guide",
    "depth": 3,
    "content": "How to Choose the Right School and Curriculum: A Complete Guide Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Sunmarke Blog > Education > What is IB Diploma Programme & How does it Prepare Students for University Offered to students aged 16–19, the IBDP is a rigorous, holistic and globally recognised qualification that equips learners with the academic excellence, intellectual curiosity, and personal growth essential for university success and beyond. A Pathway to Global Universities The IB Diploma is accepted by leading universities across the world. At Sunmarke, our IBDP graduates consistently gain admission to top-tier universities, thanks to the programme’s strong academic foundation and international credibility. University admissions officers value the IBDP because it develops well-rounded students who can think critically, write effectively, and manage their own learning. Our Sunmarke students exceed the expectations of competitive university environments. Academic Breadth and Depth Unlike other post-16 programmes, the IBDP requires students to study six subjects across a range of disciplines—ensuring a balanced education while allowing for specialisation in three higher-level subjects. This balance enables students to keep their university options open while demonstrating advanced knowledge in areas of interest. At Sunmarke, students benefit from expert faculty, small class sizes, and personalised academic mentoring that helps them excel in all subject groups—from the sciences and mathematics to the humanities and the arts. Core Components that Build University Ready Skills What truly distinguishes the IBDP is its core: Theory of Knowledge (TOK) , the Extended Essay (EE) , and Creativity, Activity, Service (CAS) . These components cultivate vital university-level skills: TOK encourages students to explore how knowledge is constructed, enhancing their critical thinking abilities. The EE is a 4,000-word research project, fostering independent research, academic writing, and analytical skills essential for university coursework. CAS pushes students beyond academics, encouraging real-world engagement and social responsibility through community service, creative pursuits, and physical challenges. Global Perspective, Personal Growth The IB’s learner profile aligns seamlessly with Sunmarke’s vision of developing innovative thinkers and compassionate leaders. Through the IBDP, students grow into inquisitive, reflective, and principled individuals ready to thrive in multicultural university settings. Our diverse student body and international outlook ensure that Sunmarke students graduate with a global mindset, an increasingly sought-after trait in higher education and the workforce. Success Beyond the Diploma At Sunmarke, our alumni go on to excel in their academic and professional journeys, often returning to share how the IBDP gave them a head start in life. If you’re considering university pathways for your child, the IB Diploma Programme at Sunmarke School Dubai offers unmatched preparation for academic excellence and lifelong success. We invite you to visit us and learn more about how we help shape the leaders of tomorrow. 0 Shares Prev Next Recent Blogs 28/11/2025 Career Readiness: Why It Matters for Students Today 21/11/2025 Expressive Art and Creativity in EYFS: Encouraging Self-Expression 14/11/2025 How Schools Can Lead the Way in Sustainable Practices 07/11/2025 The Rise of AI in Media: Opportunities for Young Creators 28/10/2025 Fortes Pro Sports Academy at Sunmarke: Nurturing the Next Generation of Student Athletes",
    "relevance_score": 0.429
  },
  {
    "url": "https://www.sunmarke.com/blog/education/38388/preparing-future-ready-students-through-21st-century-education/",
    "title": "How to Choose the Right School and Curriculum: A Complete Guide",
    "depth": 3,
    "content": "How to Choose the Right School and Curriculum: A Complete Guide Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Sunmarke Blog > Education > Preparing Future-Ready Students Through 21st Century Education In an ever-evolving world, the purpose of education extends beyond traditional academics. At Sunmarke School, we embrace a 21st century education philosophy that equips students with the skills, mindset, and adaptability required to thrive in a complex global landscape. Our approach is rooted in holistic learning , combining academic rigour with emotional intelligence, digital literacy, and character development. What Is 21st Century Education? 21st century education goes beyond textbooks and exams. It focuses on developing critical thinking , collaboration , creativity , and communication often referred to as the 4 Cs. In a world driven by technology and innovation, we also prioritise digital fluency , entrepreneurial thinking , and global citizenship . At Sunmarke, our curriculum is carefully designed to nurture not only knowledge but also transferable life skills. This ensures our students become future-ready , confident, and capable of navigating both academic and real-world challenges. A Holistic Approach to Learning We believe that true learning happens when students are engaged on every level, intellectually, emotionally, socially, and physically. Through our Positive Education Ethos , students benefit from: Wellbeing programmes that enhance resilience and mental health Leadership and entrepreneurship initiatives that foster innovation STEAM and project-based learning that build real-world problem-solving skills Performing arts and sports that develop confidence, teamwork, and discipline This whole-child development ensures students are not only prepared for exams but for life itself. Developing Skills for Tomorrow’s World Employers and universities increasingly seek individuals who are adaptable, emotionally intelligent, and lifelong learners. By integrating character strengths , such as perseverance, empathy, and integrity, into daily teaching, we help our students become compassionate leaders of tomorrow. Our focus on inquiry-based learning , digital tools like AI and coding, and environmental sustainability projects also helps students engage with real-world issues in meaningful ways. Why Parents Choose Sunmarke School Sunmarke is known for its high academic standards , innovative teaching methods, and nurturing environment. We partner closely with parents to ensure every child’s unique talent and passion are recognised and developed. As part of the Fortes Education family , we bring decades of experience in delivering world-class British and IB curricula that balance academic excellence with personal growth. Join Us in Shaping the Future At Sunmarke School, education is a journey of discovery and empowerment. We invite you to explore how our future-focused, 21st century education model is transforming young minds into global citizens and changemakers. Enquire today to learn more about our admissions and how your child can benefit from a truly holistic education. 0 Shares Prev Next Recent Blogs 28/11/2025 Career Readiness: Why It Matters for Students Today 21/11/2025 Expressive Art and Creativity in EYFS: Encouraging Self-Expression 14/11/2025 How Schools Can Lead the Way in Sustainable Practices 07/11/2025 The Rise of AI in Media: Opportunities for Young Creators 28/10/2025 Fortes Pro Sports Academy at Sunmarke: Nurturing the Next Generation of Student Athletes",
    "relevance_score": 0.429
  },
  {
    "url": "https://www.sunmarke.com/blog/education/38383/how-modern-education-programmes-are-shaping-well-rounded-learners/",
    "title": "How to Choose the Right School and Curriculum: A Complete Guide",
    "depth": 3,
    "content": "How to Choose the Right School and Curriculum: A Complete Guide Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Sunmarke Blog > Education > How Modern Education Programmes Are Shaping Well-Rounded Learners In today’s rapidly evolving world, education must extend beyond textbooks and test scores. To prepare young people for life beyond the classroom, schools are increasingly turning to a variety of enrichment programmes. For example, Sunmarke School offers its Signature and Fortes 360 programmes—tailored experiences designed to nurture the whole child. These initiatives not only deepen academic understanding but also build character, creativity, resilience, and real-world readiness. Why These Programmes Matter Traditional schooling models have long focused on academic rigour. While this remains important, it is only one piece of a much larger puzzle. Holistic education—which includes emotional intelligence, life skills, career readiness, and global awareness—is now considered essential for success in the 21st century. This is where Sunmarke School’s Signature and Fortes 360 programmes come in. Whether it’s career development, sports, STEAM and innovation, or leadership engagement, these structured, school-wide initiatives provide meaningful learning opportunities that equip students to thrive—not just in exams, but in life. 1. Early Career Exposure Children today are entering a world filled with both opportunities and uncertainties. Offering them a glimpse into various industries through structured internships, job shadowing, or even student-led podcasts helps them explore their strengths, build communication skills, and make informed decisions about their futures. Schools that offer early career development initiatives foster confidence, self-awareness, and ambition—qualities that can’t be taught through theory alone. 2. Leadership and Industry Exposure Developing leadership skills in students goes far beyond assigning roles in school councils or group projects. True leadership flourishes when young people are exposed to real-world perspectives and are given the chance to engage meaningfully with professionals from diverse sectors. Programmes like Think & Thrive at Sunmarke School allow students to participate in panel discussions, Q&A sessions, and fireside chats with leaders from various industries. These experiences foster critical thinking, boost public speaking skills, and offer invaluable insights into global issues and career landscapes. When students are encouraged to step into the role of interviewer or discussion facilitator, they gain not just confidence, but also the curiosity and communication skills essential for future leadership—whether in boardrooms, classrooms, or community spaces. 3. Multilingual and Global Mindset In an increasingly connected world, exposure to global languages and cultures is no longer optional—it’s essential. Language academies that blend cultural immersion with STEAM and project-based learning help young learners become open-minded global citizens. These initiatives prepare students to collaborate across borders—both literally and intellectually. 4. Innovation Through STEAM & Design Thinking Encouraging curiosity and creative problem-solving through STEAM (Science, Technology, Engineering, Arts, and Mathematics) has become a cornerstone of modern education. Sunmarke School’s STEAM programme includes robotics, sustainability projects, design sprints, and even AI and VR integration. These immersive experiences allow children to tackle real-world problems, preparing them for careers that may not yet exist. 5. Flexible Academic Pathways Every child learns differently. Schools that offer flexible curriculum pathways—such as A-Levels, the IB Diploma, or BTEC options—empower students to follow personalised academic journeys. When paired with strong mentoring and coaching initiatives, this approach fosters clarity, purpose, and motivation—all key ingredients for lifelong success. 6. Environmental Responsibility and Outdoor Learning Education also involves nurturing responsible stewards of the planet. At Sunmarke School our Forest School sessions, sustainability challenges, and hydroponics labs bring environmental learning to life. These experiences ignite an early appreciation for nature and encourage students to think critically about their role in building a more sustainable future. The Real Value: Preparing for Life, Not Just School What truly sets these programmes apart is the real-life relevance they bring to education. From digital fluency in AI to collaboration in design challenges, students develop transferable skills that will serve them in university, the workplace, and beyond. Schools offering such comprehensive programmes are better positioned to develop students who are not only academically capable but also emotionally resilient, socially aware, and future-ready. When considering a school for your child, it’s important to look beyond rankings and exam results. Ask yourself: Does this school develop the whole child? Does it offer enriching experiences beyond the classroom? Some of the most forward-thinking schools, particularly those recognised for innovation and student wellbeing, embed diverse programmes as a core part of their educational model. In a world that’s constantly changing, these initiatives ensure that our children aren’t just keeping up, they’re leading the way. 0 Shares Prev Next Recent Blogs 28/11/2025 Career Readiness: Why It Matters for Students Today 21/11/2025 Expressive Art and Creativity in EYFS: Encouraging Self-Expression 14/11/2025 How Schools Can Lead the Way in Sustainable Practices 07/11/2025 The Rise of AI in Media: Opportunities for Young Creators 28/10/2025 Fortes Pro Sports Academy at Sunmarke: Nurturing the Next Generation of Student Athletes",
    "relevance_score": 0.429
  },
  {
    "url": "https://www.sunmarke.com/blog/education/38027/how-to-choose-the-right-school-and-curriculum-a-complete-guide/",
    "title": "How to Choose the Right School and Curriculum: A Complete Guide",
    "depth": 3,
    "content": "How to Choose the Right School and Curriculum: A Complete Guide Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Sunmarke Blog > Education > How to Choose the Right School and Curriculum: A Complete Guide Choosing the right school and curriculum for your child is one of the most important decisions you’ll make as a parent. The right environment can shape not just academic success, but also emotional wellbeing, social confidence, and future aspirations. With a wide variety of curricula and schools in the UAE, particularly in Dubai, the process can feel overwhelming. This complete guide will walk you through the key considerations from curriculum options and teaching quality to pastoral care and future readiness. Step 1: Understand the Different Curricula One of the first things to consider is the curriculum. The most common ones offered in Dubai include: British Curriculum (National Curriculum for England) : Offers a structured approach with internationally recognised qualifications like IGCSEs and A-Levels. IB (International Baccalaureate) : Focuses on inquiry-based learning, global awareness, and student independence. American Curriculum : Offers flexibility and broad subject choices with a focus on continuous assessment. Indian Curriculum (CBSE/ICSE) : Strong in maths and science, with a rigorous approach. Other options : French, German, and bilingual schools are also available. Sunmarke School , for instance, offers a choice of A-Level, the IB Diploma Programme and BTEC , allowing students to pursue the pathway best suited to their strengths and aspirations. Step 2: Think About Your Child’s Learning Style and Interests Every child learns differently. Some thrive in academically rigorous environments, while others excel in creative, inquiry-driven settings. At Sunmarke , the focus is on a holistic approach that nurtures academic achievement alongside emotional intelligence, leadership, entrepreneurship, mindfulness and character development. This is especially important in a rapidly evolving world where adaptability and emotional resilience matter just as much as grades. Step 3: Assess Academic Results and University Destinations Academic performance remains a key consideration. It’s important to review a school’s examination outcomes, as well as its university acceptances and alumni success stories. Sunmarke School has distinguished itself in this regard, ranking 68th globally and 3rd in the UAE for IB education , with exceptional academic results and offers from some of the world’s most prestigious universities. Step 4: Explore Facilities and Extra-Curricular Opportunities A great school offers more than just academics. Modern, well-equipped campuses and rich co-curricular programmes help students discover their passions, whether in sports, arts, technology or community service. Sunmarke stands out with its world-class facilities – including innovation labs, a STEAM centre, performing arts studios, and Olympic-standard sports infrastructure. Its Signature Programmes such as STEAM & Design Thinking, Careers Development Programme, and Performing Arts give students unique opportunities to explore and excel beyond the classroom. Step 5: Evaluate Teacher Quality and Wellbeing Support Exceptional teachers are the cornerstone of any successful school. Seek out a school that prioritises hiring skilled, passionate educators and supports them with continuous professional development. At Sunmarke , our teachers are not only experts in their fields but are also trained in Positive Education , empowering students to develop resilience, optimism, and strong emotional wellbeing. This focus on pastoral care and mental health sets Sunmarke apart as a leader in nurturing well-rounded, confident individuals. Our dedicated team includes two full-time counsellors who provide expert support to both students and parents through one-to-one sessions and wellbeing workshops designed to strengthen family connections and emotional wellness. Step 6: Think Long-Term: Sixth Form and Career Preparation It’s important to consider how a school supports students in their later years, whether through strong Sixth Form programmes, university counselling, or industry exposure. Sunmarke School offers an outstanding Sixth Form , with pathways including A-Levels , BTEC, and IB. The school’s Career-Related Programme prepares students with real-world work experience, internships, and mentoring, ensuring they are future-ready . Step 7: Visit the School and Talk to the Community No guide is complete without encouraging you to visit potential schools. Attend open days, speak to teachers, observe classrooms, and get a feel for the school’s culture. Parents consistently speak of the warmth, academic rigour and forward-thinking ethos at Sunmarke , making it one of the top schools in Dubai for families who want the very best. In a competitive education landscape, Sunmarke School sets itself apart by blending academic excellence , innovative programmes , and a strong focus on wellbeing and character . It’s a school where students don’t just learn — they thrive . So, as you consider how to choose the right school and curriculum, take the time to reflect on your child’s needs, visit campuses, and prioritise a future-ready education. For many families, Sunmarke School has become that perfect choice — a place where potential is nurtured and dreams take flight. 0 Shares Prev Next Recent Blogs 28/11/2025 Career Readiness: Why It Matters for Students Today 21/11/2025 Expressive Art and Creativity in EYFS: Encouraging Self-Expression 14/11/2025 How Schools Can Lead the Way in Sustainable Practices 07/11/2025 The Rise of AI in Media: Opportunities for Young Creators 28/10/2025 Fortes Pro Sports Academy at Sunmarke: Nurturing the Next Generation of Student Athletes",
    "relevance_score": 0.429
  },
  {
    "url": "https://www.sunmarke.com/blog/education/38000/understanding-the-three-main-types-of-learning-in-education/",
    "title": "Understanding the Three Main Types of Learning in Education",
    "depth": 3,
    "content": "Understanding the Three Main Types of Learning in Education Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Sunmarke Blog > Education > Understanding the Three Main Types of Learning in Education In today’s rapidly evolving educational landscape, it is essential for educators, parents and students to understand how learning takes place. One of the most widely recognised frameworks in education identifies three primary types of learning: visual, auditory, and kinaesthetic. Each style reflects a unique way in which individuals process and retain information. Understanding these types of learning can help tailor educational experiences that are more effective and engaging for every child. 1. Visual Learning Visual learners absorb information best when it is presented through images, diagrams, charts, or written directions. They often benefit from seeing information mapped out, and tend to remember what they observe more than what they hear. These learners may enjoy activities such as drawing, mind-mapping, watching videos, or working with infographics. At schools that promote innovation and creativity, such as Sunmarke , visual learning is integrated into daily teaching through interactive whiteboards, multimedia presentations and project-based learning — all of which help bring concepts to life visually. 2. Auditory Learning Auditory learners prefer to listen. They learn best through spoken information, whether it’s a lecture, discussion, podcast, or verbal instruction. These students tend to excel when they can engage in conversations, read aloud, or explain ideas to others. To support auditory learners, classrooms often include storytelling, group discussions, language-rich activities and opportunities for presentation and debate. Environments that encourage communication and collaborative learning, as seen in many forward-thinking schools, help auditory learners thrive. 3. Kinaesthetic Learning Kinaesthetic or tactile learners prefer hands-on experiences. They grasp concepts more effectively when they can move, touch, build or physically interact with their learning materials. These students might struggle with sitting still for long periods but shine in practical tasks, experiments, and active play. Schools that promote whole-child development understand the importance of movement and real-world learning. Through STEAM labs, outdoor education, role play, and physical activities, kinaesthetic learners are given ample opportunities to engage in meaningful, embodied learning. A Balanced Approach While many students may show a preference for one particular learning style, it’s important to recognise that most children are multimodal learners — they benefit from a mix of visual, auditory and kinaesthetic experiences. A holistic, personalised approach to education that draws on all three types of learning can foster deeper understanding, stronger engagement, and long-term academic success. Conclusion Recognising the three main types of learning can help educators and parents support students more effectively, ensuring that every child has the opportunity to reach their full potential. Schools that embrace differentiated instruction and celebrate diverse learning styles — as part of a broader commitment to nurturing character, wellbeing and future readiness — stand at the forefront of modern education. 0 Shares Prev Next Recent Blogs 28/11/2025 Career Readiness: Why It Matters for Students Today 21/11/2025 Expressive Art and Creativity in EYFS: Encouraging Self-Expression 14/11/2025 How Schools Can Lead the Way in Sustainable Practices 07/11/2025 The Rise of AI in Media: Opportunities for Young Creators 28/10/2025 Fortes Pro Sports Academy at Sunmarke: Nurturing the Next Generation of Student Athletes",
    "relevance_score": 0.394
  },
  {
    "url": "https://www.sunmarke.com/blog/education/37067/key-learning-behaviours-that-shape-success-in-primary-school/",
    "title": "Key Learnings for Success in Primary School - Sunmarke School",
    "depth": 3,
    "content": "Key Learnings for Success in Primary School - Sunmarke School Apply Visit Enquire VLE Login About Principal’s Message Mission, Vision, Values A Positive Education School Leadership Academic Results Inspection Reports Our Achievements Sunmarke Alumni Wellbeing The Achievement Centre – Inclusion Department Our Campus Learning Nursery Our Approach Enriched Learning EYFS Our Approach Early Years Curriculum Enriched Learning Primary Our Approach Primary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Student Council and Ambassadors Secondary Our Approach Secondary Curriculum Sports & PE Creative & Performing Arts Enriched Learning Coding Sunmarke Mini MBA Student Council and Ambassadors Sixth Form Our Approach A-Levels BTECs IB Diploma Programme (IBDP) Student Enrichment Coding CIVITAS Careers Counsellor Student Leadership Signature Programmes STEAM & Design Thinking Environment & Sustainability University & Career Readiness Programme Fortes Pro Sports Academy Positive Education Global Language Academy Financial Literacy Programme Enterprise & Mini-MBA Programme Communications, Media & the Performing Arts Programme Admissions Apply Online Schedule a Visit Tuition Fees Scholarships Re-enrol Online School Forms FAQs For Parents School Uniform School Timings Academic Calendar School Events Calendar Policies Transport Services Dining & Catering Sports Hub Parent Engagement Governance Committee Activities Sunmarke Free Extracurricular Activities (ECAs) Sunmarke Paid Extracurricular Activities Third-Party Paid Extracurricular Activities News & Events Weekly Buzz Blog Press Podcasts Contact Us Work With Us Apply Visit Enquire VLE Login Sunmarke Blog > Education > Key Learning Behaviours That Shape Success in Primary School Primary school is more than just a place where children acquire knowledge — it’s a foundation for life-long habits, attitudes and behaviours that shape not only academic progress but also personal growth and success. At this vital stage, developing strong learning behaviours plays a crucial role in how students engage with their education and the world around them. Here are some key learning behaviours that are essential in shaping success in primary school: Curiosity and a Love for Learning: Children are naturally inquisitive and, when their curiosity is nurtured, they become more engaged and motivated learners. Encouraging students to ask questions, explore new ideas and take initiative in their learning helps build a mindset where they see learning as a lifelong journey rather than a destination. Resilience and Growth Mindset: Learning is not always a smooth path. Mistakes are inevitable but the ability to persevere through challenges is what leads to real growth. A resilient child understands that setbacks are part of the process and embraces the idea that intelligence and ability can develop with effort and practice. Independence and Self-Regulation: As children progress through primary school, they begin to take more responsibility for their own learning. This includes organising their work, managing their time effectively and understanding how they learn best. Developing independence prepares students not just for future academic stages but also for real-world situations where initiative and self-direction are key. Collaboration and Social Skills: Success in school – and beyond – often depends on how well individuals work with others. Learning how to communicate effectively, listen actively, share ideas and resolve differences constructively are essential skills. Primary school offers many opportunities for children to collaborate in group tasks, projects and discussions, all of which help foster empathy, respect and teamwork. Reflective Thinking: Encouraging students to think about their learning — what went well, what could be improved and how to approach things differently next time — helps build a reflective mindset. This self-awareness leads to deeper understanding, more meaningful learning and stronger personal accountability. Creativity and Critical Thinking: Learning isn’t just about remembering facts — it’s about making connections, solving problems and thinking in new ways. Schools that encourage creative expression and analytical thinking help students become more adaptable, open-minded and capable of navigating complex challenges. Fostering the Right Environment A supportive and stimulating environment is essential to nurturing these behaviours. Teachers play a central role in modelling positive habits and creating learning experiences that challenge and inspire. At schools like Sunmarke , there is a strong emphasis on character education, wellbeing and innovative teaching approaches that cater to individual strengths and learning styles. When students are encouraged to be curious, resilient, independent, collaborative, reflective and creative, they are not just prepared for academic success — they are equipped to thrive in all aspects of life. 0 Shares Prev Next Recent Blogs 28/11/2025 Career Readiness: Why It Matters for Students Today 21/11/2025 Expressive Art and Creativity in EYFS: Encouraging Self-Expression 14/11/2025 How Schools Can Lead the Way in Sustainable Practices 07/11/2025 The Rise of AI in Media: Opportunities for Young Creators 28/10/2025 Fortes Pro Sports Academy at Sunmarke: Nurturing the Next Generation of Student Athletes",
    "relevance_score": 0.353
  }
]